{"classes":[{"name":"Barbarian","short-description":"Stoic warrior who uses tremendous physical strength to crush foes.","features":[{"name":"Melee Mastery","icon":"barbarian-feature-1","description":"Barbarians casually swing weapons that ordinary warriors can barely lift. They're able to fight with a full-sized blade, hammer, or axe gripped in each fist, or with enormous (but ponderous) great weapons that crush their enemies into paste."},{"name":"Brutal Attacks","icon":"barbarian-feature-2","description":"Strength and anger go well together. When they lend plenty of Fury to their strikes, barbarians can send their foes flying, shear their limbs off, or knock their bones free of their flesh."},{"name":"Shouts","icon":"barbarian-feature-3","description":"Barbarians are mighty presences on the battlefield, and their ferocious war cries can bring out battle frenzy in their allies or send their tiny foes fleeing in terror. Even mighty foes who hear a barbarian's shout can become too shaken to land their most deadly blows."},{"name":"Taking Hits","icon":"barbarian-feature-4","description":"No other heroes can shrug off enemy attacks the way that barbarians do. Their massive strength allows them to equip heavy shields, and their flesh deflects oncoming blades and teeth like metal armor."}],"resource":"The rage that fills true barbarians cannot be extinguished so long as they live. Fury, a resource that represents pure anger and battle-lust, powers their every terrifying strike. Fury rises in barbarians as they are damaged, and when they draw their enemies' blood. As barbarians suffer increasing damage from their enemies (and quickly cut them down in response) their Fury builds to a peak. Excess Fury can be put to explosive use - barbarians can smash and destroy the battlefield, hurl themselves through the air, and split their opponents in two. Outside of combat, Fury wanes quickly, so adept Barbarians charge from battle to battle to ensure that they can continually deliver devastating attacks.","resource-type":"Fury","description":"Barbarians are savage wanderers who never flinch from close-quarters combat. Mighty ground stomps, leaping attacks and dual-wielded slashes leave a barbarian's enemies dead in their boots and send any survivors fleeing for cover. Thanks to their size and strength, barbarians can dominate a melee with nearly any combination of weapon and approach, though they tend towards massive and imposing weaponry. Barbarians are no strangers to the pains of battle, and often fare better in the midst of several opponents, taking and giving cuts, than when attempting to chase down single targets. Barbarians' attacks are primarily melee focused. Their quick weapon swings whittle down the number of weaker foes in seconds, while their slower, ground-shaking slams and stomps can send approaching hordes reeling and crack the armor of mightier foes. ","lore":"For ages, the barbarians dwelling in the shadow of Mount Arreat were shaped to be as strong and unyielding as stone. Immense in size and unmatched in ferocity, they were charged from birth with a duty passed through generations: to protect the sacred mountain. When their homeland was shattered, many barbarians lost faith. They became aimless, haunted by their past, traveling from place to place without honor or direction. But not all barbarians have given up their vigil. Some still honor the harsh snows of Arreat's summit and prowl the outskirts of its crater. They recall being handed axes and spears at an age when city children were clinging to their toys... and they burn with shame at the failure of their people. These barbarians strive to find a new purpose for themselves in a changed world, and they will crush any who stand in their way.","equipment":"Barbarians are able to make use of weapons in ways that others simply don't possess the strength for. They wield massive weapons - oversized killing devices that more urbane heroes are barely strong enough to lift, let alone swing. Heavily-muscled barbarians can also dual-wield normal weapons like swords and axes, barraging foes with multiple enchantments and weapon types at once.","tier-1":"Early on in their journey, padded leather provides untested barbarians with basic protection...but most enemy attacks will still fall upon their unarmored skin.","tier-2":"A greater variety of gear to choose from means that barbarians can shield their vitals with close-faced helms, imposing spikes, and armor plates.","tier-3":"Barbarians bedecked in truly heavy armor look more like nightmare visions than humans, and they have the resilience to match.","active-skills":[{"name":"Bash","required-level":1,"icon":"barbarian_bash","type":"Primary","generate":8,"generate-units":"Fury","generate-description":"per attack","description":"Brutally smash an enemy for 165% weapon damage with a 20% chance to Knockback.","runes":[{"required-level":6,"name":"Clobber","description":"Instead of Knockback, each hit has a 35% chance to Stun the target for 1.5 seconds.","icon":"rune_c"},{"required-level":13,"name":"Onslaught","description":"Add 2 reverberations that cause 25% weapon damage per strike. Removes the chance for Knockback.","icon":"rune_a"},{"required-level":26,"name":"Punish","description":"Increases the damage of your skills by 8% for 5 seconds after using Bash. This effect stacks up to 3 times.","icon":"rune_b"},{"required-level":44,"name":"Instigation","description":"Generate 4 additional Fury per attack.","icon":"rune_d"},{"required-level":52,"name":"Pulverize","description":"Cause a shockwave that inflicts 38% weapon damage to enemies in a 26 yard line behind the targeted enemy.","icon":"rune_e"}]},{"name":"Hammer of the Ancients","required-level":2,"icon":"barbarian_hammeroftheancients","type":"Secondary","cost":20,"cost-units":"Fury","cost-description":"","description":"Call forth a massive hammer to smash enemies directly in front of you for 325% weapon damage. Hammer of the Ancients has a 1% increased Critical Hit Chance for every 5 Fury that you have.","runes":[{"required-level":7,"name":"Rolling Thunder","description":"Create a shockwave that deals 275% weapon damage to all enemies within 22 yards in front of you.","icon":"rune_b"},{"required-level":15,"name":"Smash","description":"Strike a smaller area for 406% weapon damage.","icon":"rune_a"},{"required-level":27,"name":"The Devil's Anvil","description":"Create a tremor at the point of impact for 2 seconds that slows the movement speed of enemies by 80%.","icon":"rune_c"},{"required-level":39,"name":"Thunderstrike","description":"Whenever you kill an enemy with Hammer of the Ancients every other enemy within 10 yards is stunned for 3 seconds.","icon":"rune_e"},{"required-level":53,"name":"Birthright","description":"Critical Hits have a 10% chance to cause enemies to drop treasure or health globes.","icon":"rune_d"}]},{"name":"Cleave","required-level":3,"icon":"barbarian_cleave","type":"Primary","generate":5,"generate-units":"Fury","generate-description":"per attack","description":"Swing your weapon in a wide arc to deal 140% weapon damage to all enemies caught in the swing.","runes":[{"required-level":9,"name":"Rupture","description":"Enemies slain by Cleave explode, causing 85% weapon damage to all other enemies within 8 yards.","icon":"rune_e"},{"required-level":18,"name":"Reaping Swing","description":"Generate 3 additional Fury per enemy hit.","icon":"rune_d"},{"required-level":30,"name":"Scattering Blast","description":"On Critical Hits, knock enemies back 9 yards and inflict 60% weapon damage to enemies where they land.","icon":"rune_c"},{"required-level":47,"name":"Broad Sweep","description":"Increase damage to 175% weapon damage.","icon":"rune_a"},{"required-level":55,"name":"Gathering Storm","description":"Enemies cleaved have their movement speed reduced by 80% for 1 seconds.","icon":"rune_b"}]},{"name":"Ground Stomp","required-level":4,"icon":"barbarian_groundstomp","type":"Defensive","generate":15,"generate-units":"Fury","generate-description":"","cooldown":12,"cooldown-units":"seconds","cooldown-description":"","description":"Smash the ground, stunning all enemies within 12 yards for 4 seconds.","runes":[{"required-level":12,"name":"Deafening Crash","description":"Enemies in the area have their movement speed slowed by 60% for 3 seconds after they recover from being stunned.","icon":"rune_e"},{"required-level":18,"name":"Wrenching Smash","description":"Increase the area of effect to 24 yards. Enemies are pulled closer before the strike lands.","icon":"rune_b"},{"required-level":28,"name":"Trembling Stomp","description":"Enemies in the area also take 76% weapon damage.","icon":"rune_a"},{"required-level":40,"name":"Foot of the Mountain","description":"Increase Fury gained to 30.","icon":"rune_d"},{"required-level":54,"name":"Avalanche","description":"Enemies are knocked back 9 yards and inflict 55% weapon damage to enemies in the landing area.","icon":"rune_c"}]},{"name":"Rend","required-level":5,"icon":"barbarian_rend","type":"Secondary","cost":20,"cost-units":"Fury","cost-description":"","description":"A sweeping strike causes all nearby enemies to Bleed for 700% weapon damage as Physical over 5 seconds.","runes":[{"required-level":11,"name":"Ravage","description":"Increase the range of Rend to hit all enemies within 17 yards.","icon":"rune_b"},{"required-level":19,"name":"Blood Lust","description":"Gain 9% of the damage done by Rend as Life.","icon":"rune_d"},{"required-level":33,"name":"Lacerate","description":"Increase damage to 903% weapon damage as Physical over 5 seconds.","icon":"rune_a"},{"required-level":45,"name":"Mutilate","description":"Affected enemies also have their movement speed reduced by 60%.","icon":"rune_c"},{"required-level":56,"name":"Bloodbath","description":"Enemies killed while bleeding cause all enemies within 10 yards to begin bleeding for 100% weapon damage as Physical over 5 seconds.","icon":"rune_e"}]},{"name":"Leap","required-level":8,"icon":"barbarian_leap","type":"Defensive","generate":15,"generate-units":"Fury","generate-description":"","cooldown":10,"cooldown-units":"seconds","cooldown-description":"","description":"Leap into the air, dealing 85% weapon damage to all enemies within 8 yards of your destination and slowing their movement speed by 60% for 3 seconds.","runes":[{"required-level":14,"name":"Iron Impact","description":"Gain 100% additional Armor per enemy hit for 3 seconds after landing.","icon":"rune_d"},{"required-level":21,"name":"Launch","description":"Jump into the air with such great force that enemies within 8 yards of the origin of the jump are also slowed by 60% for 3 seconds.","icon":"rune_c"},{"required-level":32,"name":"Toppling Impact","description":"Send enemies hurtling away from where you land.","icon":"rune_b"},{"required-level":44,"name":"Call of Arreat","description":"Shockwaves burst forth from the ground increasing the radius of effect to 16 yards and pulling affected enemies towards you.","icon":"rune_a"},{"required-level":60,"name":"Death from Above","description":"Land with such force that enemies have a 100% chance to be stunned for 3 seconds.","icon":"rune_e"}]},{"name":"Ancient Spear","required-level":9,"icon":"barbarian_ancientspear","type":"Might","generate":15,"generate-units":"Fury","generate-description":"","cooldown":10,"cooldown-units":"seconds","cooldown-description":"","description":"Throw a spear to pull an enemy back to you, briefly slowing the target's movement by 60% and dealing 185% weapon damage.","runes":[{"required-level":15,"name":"Grappling Hooks","description":"Throw 3 spears. Each spear will pull back the enemy that it hits.","icon":"rune_b"},{"required-level":23,"name":"Skirmish","description":"Increases Fury gained to 30.","icon":"rune_d"},{"required-level":32,"name":"Dread Spear","description":"Gain Life equal to 60% of the damage inflicted.","icon":"rune_c"},{"required-level":39,"name":"Harpoon","description":"Pierce through multiple enemies in a straight line and drag them all back.","icon":"rune_a"},{"required-level":49,"name":"Rage Flip","description":"Enemies hit with Ancient Spear are pulled in the opposite direction and damage is increased to 213% weapon damage.","icon":"rune_e"}]},{"name":"Frenzy","required-level":11,"icon":"barbarian_frenzy","type":"Primary","generate":3,"generate-units":"Fury","generate-description":"per attack","description":"Swing for 110% weapon damage. Frenzy attack speed increases by 15% with each swing. This effect can stack up to 5 times for a total bonus of 75% attack speed.","runes":[{"required-level":17,"name":"Sidearm","description":"Each strike has a 25% chance to throw a piercing axe at a nearby enemy that deals 110% weapon damage to all enemies in its path.","icon":"rune_b"},{"required-level":22,"name":"Triumph","description":"Killing an enemy with Frenzy heals you for 8% of your maximum Life over 6 seconds.","icon":"rune_e"},{"required-level":34,"name":"Vanguard","description":"While under the effects of Frenzy, you gain 15% increased movement speed.","icon":"rune_c"},{"required-level":51,"name":"Smite","description":"Add a 20% chance to call down a bolt of lightning from above, stunning your target for 1.5 seconds.","icon":"rune_d"},{"required-level":59,"name":"Maniac","description":"Each Frenzy effect also increases your damage by 4%.","icon":"rune_a"}]},{"name":"Seismic Slam","required-level":12,"icon":"barbarian_seismicslam","type":"Secondary","cost":30,"cost-units":"Fury","cost-description":"","description":"Slam the ground and cause a wave of destruction that deals 240% weapon damage and Knockback to targets in a 45 yard arc.","runes":[{"required-level":18,"name":"Stagger","description":"Add a 70% chance of stunning enemies for 1.5 seconds.","icon":"rune_c"},{"required-level":25,"name":"Shattered Ground","description":"Increase damage to 288% weapon damage and increases Knockback distance by 100%.","icon":"rune_a"},{"required-level":35,"name":"Rumble","description":"The ground continues to shudder after the initial strike, damaging enemies in the area for 60% weapon damage as Physical over 2 seconds.","icon":"rune_b"},{"required-level":48,"name":"Strength from Earth","description":"Reduce Fury cost to 15 Fury.","icon":"rune_d"},{"required-level":57,"name":"Cracking Rift","description":"Focus the seismic shockwaves along a narrow path to inflict 340% weapon damage to targets along a 42 yard path.","icon":"rune_e"}]},{"name":"Revenge","required-level":13,"icon":"barbarian_revenge","type":"Might","description":"Revenge has a 15% chance to become active each time you are hit. Inflict 220% weapon damage to all nearby enemies. You heal 5.0% of your maximum Life for each enemy hit.","runes":[{"required-level":19,"name":"Vengeance Is Mine","description":"Gain 5 Fury and heal for 8.0% of your maximum Life for each enemy hit.","icon":"rune_d"},{"required-level":25,"name":"Best Served Cold","description":"After using Revenge, your Critical Hit Chance is increased by 10% for 12 seconds.","icon":"rune_e"},{"required-level":36,"name":"Retribution","description":"Increase damage to 286% weapon damage.","icon":"rune_a"},{"required-level":41,"name":"Grudge","description":"Knocks enemies back 24 yards whenever Revenge is used.","icon":"rune_c"},{"required-level":52,"name":"Provocation","description":"Increases the chance Revenge will become active to 30% each time you are hit by an attack.","icon":"rune_b"}]},{"name":"Weapon Throw","required-level":14,"icon":"barbarian_weaponthrow","type":"Tactics","cost":10,"cost-units":"Fury","cost-description":"","description":"Hurl a throwing weapon at an enemy for 130% weapon damage and Slow the movement of the enemy by 60% for 2 seconds.","runes":[{"required-level":21,"name":"Mighty Throw","description":"Increase thrown weapon damage to 169% weapon damage.","icon":"rune_a"},{"required-level":25,"name":"Ricochet","description":"Cause the weapon to ricochet and hit up to 3 targets within 20 yards of each other.","icon":"rune_b"},{"required-level":33,"name":"Throwing Hammer","description":"Hurl a hammer with a 50% chance to Stun the target for 1.5 seconds.","icon":"rune_c"},{"required-level":42,"name":"Stupefy","description":"Aim for the head, gaining a 20% chance of causing your target to be Confused and attack other enemies for 6 seconds.","icon":"rune_e"},{"required-level":54,"name":"Dread Bomb","description":"Expend all remaining Fury to throw a corpse which inflicts an additional 3% weapon damage for each point of Fury expended to all enemies within 12 yards of the target.","icon":"rune_d"}]},{"name":"Sprint","required-level":16,"icon":"barbarian_sprint","type":"Defensive","cost":20,"cost-units":"Fury","cost-description":"","description":"Increase movement speed by 40% for 3 seconds.","runes":[{"required-level":23,"name":"Rush","description":"Increases Dodge Chance by 12% while sprinting.","icon":"rune_b"},{"required-level":29,"name":"Run Like the Wind","description":"Tornadoes rage in your wake, each one inflicting 60% weapon damage as Physical for 3 seconds to nearby enemies.","icon":"rune_c"},{"required-level":38,"name":"Marathon","description":"Increases the movement speed bonus to 50% for 5 seconds.","icon":"rune_a"},{"required-level":46,"name":"Gangway","description":"Slams through enemies, knocking them back and inflicting 25% weapon damage.","icon":"rune_e"},{"required-level":53,"name":"Forced March","description":"Increase the movement speed of allies within 50 yards by 20% for 3 seconds.","icon":"rune_d"}]},{"name":"Threatening Shout","required-level":17,"icon":"barbarian_threateningshout","type":"Tactics","generate":15,"generate-units":"Fury","generate-description":"","cooldown":10,"cooldown-units":"seconds","cooldown-description":"","description":"Shout with great ferocity, reducing damage done by enemies within 25 yards by 20% for 15 seconds.","runes":[{"required-level":23,"name":"Intimidate","description":"Affected enemies also have their movement speed reduced by 30%.","icon":"rune_b"},{"required-level":28,"name":"Falter","description":"Affected enemies also have their attack speed reduced by 15% for 5 seconds.","icon":"rune_d"},{"required-level":37,"name":"Grim Harvest","description":"Enemies are badly shaken and have a 15% chance to drop additional treasure or health globes.","icon":"rune_c"},{"required-level":43,"name":"Demoralize","description":"Affected enemies are also taunted to attack you for 3 seconds.","icon":"rune_a"},{"required-level":57,"name":"Terrify","description":"Enemies are severely demoralized. Each enemy has a 35% chance to flee for 2.5 seconds.","icon":"rune_e"}]},{"name":"Earthquake","required-level":19,"icon":"barbarian_earthquake","type":"Rage","cost":50,"cost-units":"Fury","cost-description":"","cooldown":120,"cooldown-units":"seconds","cooldown-description":"","description":"Shake the ground violently, dealing 2000% weapon damage as Fire over 8 seconds to all enemies within 18 yards.","runes":[{"required-level":24,"name":"Giant's Stride","description":"Secondary tremors follow your movement and inflict 65% weapon damage as Fire.","icon":"rune_b"},{"required-level":29,"name":"Chilling Earth","description":"Creates an icy patch, causing Earthquake's damage to turn Cold and Slow the movement of enemies by 80%.","icon":"rune_c"},{"required-level":39,"name":"The Mountain's Call","description":"Removes the Fury cost and reduces the cooldown to 105 seconds.","icon":"rune_d"},{"required-level":50,"name":"Aftershocks","description":"Secondary tremors knock enemies back and inflict 65% weapon damage as Fire.","icon":"rune_a"},{"required-level":56,"name":"Path of Fire","description":"Project secondary tremors up to 12 yards ahead of you that inflict 65% weapon damage as Fire.","icon":"rune_e"}]},{"name":"Whirlwind","required-level":20,"icon":"barbarian_whirlwind","type":"Secondary","cost":10,"cost-units":"Fury","cost-description":"","description":"Deliver multiple attacks to everything in your path for 145% weapon damage.","runes":[{"required-level":24,"name":"Dust Devils","description":"Generate harsh tornadoes that inflict 40% weapon damage to enemies in their path.","icon":"rune_b"},{"required-level":29,"name":"Hurricane","description":"Allows you to move at your movement speed while using Whirlwind.","icon":"rune_c"},{"required-level":37,"name":"Blood Funnel","description":"Critical Hits restore 2.0% of your maximum Life.","icon":"rune_e"},{"required-level":44,"name":"Wind Shear","description":"Gain 1 Fury for every enemy struck.","icon":"rune_d"},{"required-level":59,"name":"Volcanic Eruption","description":"Turns Whirlwind into a torrent of magma that inflicts 189% weapon damage as Fire.","icon":"rune_a"}]},{"name":"Furious Charge","required-level":21,"icon":"barbarian_furiouscharge","type":"Might","generate":15,"generate-units":"Fury","generate-description":"","cooldown":10,"cooldown-units":"seconds","cooldown-description":"","description":"Rush forward knocking back enemies and inflicting 195% weapon damage to enemies along the path of the charge.","runes":[{"required-level":27,"name":"Battering Ram","description":"Increase damage at the destination to 283% weapon damage.","icon":"rune_a"},{"required-level":33,"name":"Merciless Assault","description":"Cooldown is reduced by 2 seconds for every target hit. This effect can reduce the cooldown by up to 10 seconds.","icon":"rune_e"},{"required-level":38,"name":"Stamina","description":"Generate 8 additional Fury for each target hit while charging.","icon":"rune_d"},{"required-level":47,"name":"Bull Rush","description":"Any targets who are critically hit by Furious Charge will be stunned for 2.5 seconds.","icon":"rune_c"},{"required-level":56,"name":"Dreadnought","description":"Regain 8% of your maximum Life for each target hit by Furious Charge.","icon":"rune_b"}]},{"name":"Ignore Pain","required-level":22,"icon":"barbarian_ignorepain","type":"Defensive","cooldown":30,"cooldown-units":"seconds","cooldown-description":"","description":"Reduces all damage taken by 65% for 5 seconds.","runes":[{"required-level":26,"name":"Bravado","description":"When activated, Knockback all enemies within 12 yards and deal 50% weapon damage to them.","icon":"rune_d"},{"required-level":31,"name":"Iron Hide","description":"Increases duration to 7 seconds.","icon":"rune_b"},{"required-level":36,"name":"Ignorance is Bliss","description":"While Ignore Pain is active, gain 20% of all damage dealt as Life.","icon":"rune_e"},{"required-level":43,"name":"Mob Rule","description":"Extend the effect to nearby allies, reducing damage taken by 65% for 5 seconds.","icon":"rune_c"},{"required-level":58,"name":"Contempt for Weakness","description":"Reflects 50% of ignored damage back at the enemy.","icon":"rune_a"}]},{"name":"Battle Rage","required-level":22,"icon":"barbarian_battlerage","type":"Tactics","cost":20,"cost-units":"Fury","cost-description":"","description":"Enter a rage which increases damage by 15% and Critical Hit Chance by 3% for 120 seconds.","runes":[{"required-level":26,"name":"Marauder's Rage","description":"Increase damage bonus to 30%.","icon":"rune_a"},{"required-level":31,"name":"Ferocity","description":"While under the effects of Battle Rage, Critical Hits have a chance to increase the duration of Battle Rage by 2 seconds.","icon":"rune_b"},{"required-level":38,"name":"Swords to Ploughshares","description":"While under the effects of Battle Rage, Critical Hits have up to a 5% chance to cause enemies to drop additional health globes.","icon":"rune_c"},{"required-level":46,"name":"Into the Fray","description":"While under the effects of Battle Rage, Critical Hits have a chance to generate 15 additional Fury.","icon":"rune_d"},{"required-level":54,"name":"Bloodshed","description":"While under the effects of Battle Rage, Critical Hits have a chance to cause an explosion of blood dealing 20% of the damage done to all other nearby enemies.","icon":"rune_e"}]},{"name":"Call of the Ancients","required-level":25,"icon":"barbarian_calloftheancients","type":"Rage","cost":50,"cost-units":"Fury","cost-description":"","cooldown":120,"cooldown-units":"seconds","cooldown-description":"","description":"Summon the ancient Barbarians Talic, Korlic, and Madawc to fight alongside you for 15 seconds. Each deals 60% weapon damage per swing in addition to bonus abilities. Talic wields a sword and shield and uses the Whirlwind skill. Korlic wields a massive polearm and uses the Cleave skill. Madawc dual-wields axes and uses the Weapon Throw skill.","runes":[{"required-level":31,"name":"The Council Rises","description":"The Ancients inflict 66% weapon damage with each attack and have 100% additional Armor.","icon":"rune_b"},{"required-level":37,"name":"Duty to the Clan","description":"Increase duration to 20 seconds.","icon":"rune_d"},{"required-level":45,"name":"Korlic's Might","description":"Korlic gains the skill Furious Charge which deals 200% of your weapon damage to all enemies in a line.","icon":"rune_a"},{"required-level":51,"name":"Madawc's Madness","description":"Madawc gains the skill Seismic Slam which deals 180% of your weapon damage to enemies in an arc.","icon":"rune_c"},{"required-level":58,"name":"Talic's Anger","description":"Talic gains the skill Leap which deals 250% of your weapon damage to enemies in the area of the leap.","icon":"rune_e"}]},{"name":"Overpower","required-level":26,"icon":"barbarian_overpower","type":"Might","cooldown":12,"cooldown-units":"seconds","cooldown-description":"","description":"Deal 165% weapon damage to all targets within 9 yards. Landing a Critical Hit has a chance to lower the cooldown by 1 second.","runes":[{"required-level":29,"name":"Storm of Steel","description":"Throw up to 3 axes at nearby enemies which inflict 50% weapon damage each.","icon":"rune_b"},{"required-level":34,"name":"Killing Spree","description":"Your Critical Hit Chance is increased by 10% for 6 seconds.","icon":"rune_a"},{"required-level":42,"name":"Crushing Advance","description":"Redirect 35% of incoming melee and ranged damage for 4 seconds after Overpower is activated.","icon":"rune_e"},{"required-level":48,"name":"Momentum","description":"Generate 12 Fury for each enemy hit by Overpower.","icon":"rune_d"},{"required-level":59,"name":"Revel","description":"Heal 8% of your maximum Life for every enemy hit.","icon":"rune_c"}]},{"name":"War Cry","required-level":28,"icon":"barbarian_warcry","type":"Tactics","generate":20,"generate-units":"Fury","generate-description":"","cooldown":20,"cooldown-units":"seconds","cooldown-description":"","description":"Unleash a rallying cry to increase Armor for you and all allies within 50 yards by 20% for 60 seconds.","runes":[{"required-level":32,"name":"Hardened Wrath","description":"Increases the Armor bonus to 40%.","icon":"rune_a"},{"required-level":35,"name":"Charge!","description":"Increases Fury gained to 40.","icon":"rune_d"},{"required-level":41,"name":"Invigorate","description":"Increases maximum Life by 10% and regenerates 310 Life per second while affected by War Cry.","icon":"rune_e"},{"required-level":49,"name":"Veteran's Warning","description":"War Cry also grants a 15% bonus to Dodge Chance.","icon":"rune_b"},{"required-level":60,"name":"Impunity","description":"All of your resistances are increased by 20% while affected by War Cry.","icon":"rune_c"}]},{"name":"Wrath of the Berserker","required-level":30,"icon":"barbarian_wrathoftheberserker","type":"Rage","cost":50,"cost-units":"Fury","cost-description":"","cooldown":120,"cooldown-units":"seconds","cooldown-description":"","description":"Enter a berserker rage which raises several attributes for 15 seconds. Critical Hit Chance: 10%Attack Speed: 25%Dodge Chance: 20%Movement Speed: 20%","runes":[{"required-level":36,"name":"Arreat's Wail","description":"Activating Wrath of the Berserker knocks back all enemies within 12 yards and deals 430% weapon damage to them.","icon":"rune_b"},{"required-level":40,"name":"Insanity","description":"While active your damage is also increased by 100%.","icon":"rune_a"},{"required-level":46,"name":"Slaughter","description":"While Wrath of the Berserker is active, Critical Hits have a chance to cause an eruption of blood dealing 155% weapon damage to enemies within 15 yards.","icon":"rune_e"},{"required-level":52,"name":"Striding Giant","description":"Increases bonus to Dodge Chance to 60%.","icon":"rune_c"},{"required-level":60,"name":"Thrive on Chaos","description":"Every 25 Fury gained while Wrath of the Berserker is active adds 1 second to the duration of the effect.","icon":"rune_d"}]}],"passive-skills":[{"type":"Passive","name":"Pound of Flesh","required-level":10,"icon":"barbarian_passive_poundofflesh","description":"Increases the chance of finding a health globe by 25% and you gain 100% additional Life from health globes."},{"type":"Passive","name":"Ruthless","required-level":10,"icon":"barbarian_passive_ruthless","description":"Critical Hit Chance increased by 5%. Critical Hit Damage increased by 50%. Many skills and runes rely on Critical Hits to trigger their effects."},{"type":"Passive","name":"Nerves Of Steel","required-level":13,"icon":"barbarian_passive_nervesofsteel","description":"Your Armor is increased by 100% of your Vitality."},{"type":"Passive","name":"Weapons Master","required-level":16,"icon":"barbarian_passive_weaponsmaster","description":"Gain a bonus based on the weapon type of your main hand weapon:Swords\/Daggers: 15% increased damageMaces\/Axes: 10% Critical Hit ChancePolearms\/Spears: 10% attack speedMighty Weapons: 3 Fury per hit"},{"type":"Passive","name":"Inspiring Presence","required-level":20,"icon":"barbarian_passive_inspiringpresence","description":"The duration of your shouts is doubled. After using a shout you regenerate 2% of your maximum Life per second for 60 seconds. Your shouts are: Battle Rage Threatening Shout War Cry"},{"type":"Passive","name":"Berserker Rage","required-level":20,"icon":"barbarian_passive_berserkerrage","description":"You inflict an additional 25% damage while at maximum Fury."},{"type":"Passive","name":"Bloodthirst","required-level":24,"icon":"barbarian_passive_bloodthirst","description":"Gain 3% of all damage done as Life."},{"type":"Passive","name":"Animosity","required-level":27,"icon":"barbarian_passive_animosity","description":"Increases Fury generation by 20% and maximum Fury is increased by 20. Fury is used to fuel your most powerful attacks."},{"type":"Passive","name":"Superstition","required-level":30,"icon":"barbarian_passive_superstition","description":"Reduces all non-Physical damage by 20%. Whenever you take damage from a ranged or elemental attack, you have a chance to gain 3 Fury."},{"type":"Passive","name":"Tough as Nails","required-level":30,"icon":"barbarian_passive_toughasnails","description":"Increases Armor by 25%.Thorns damage dealt increased by 50%."},{"type":"Passive","name":"No Escape","required-level":35,"icon":"barbarian_passive_noescape","description":"Increases the damage of Ancient Spear and Weapon Throw by 10%. In addition, a Critical Hit with Ancient Spear resets the cooldown while Critical Hits with Weapon Throw have a chance to return 14 Fury."},{"type":"Passive","name":"Relentless","required-level":40,"icon":"barbarian_passive_relentless","description":"While below 20% Life, all skills cost 75% less Fury and all damage taken is reduced by 50%."},{"type":"Passive","name":"Brawler","required-level":45,"icon":"barbarian_passive_brawler","description":"As long as there are 3 enemies within 8 yards, all of your damage is increased by 30%."},{"type":"Passive","name":"Juggernaut","required-level":50,"icon":"barbarian_passive_juggernaut","description":"The duration of control impairing effects on you is reduced by 20%. In addition, whenever a Stun, Fear, Immobilize or Charm is cast on you, you have a chance to recover 15% of your maximum Life."},{"type":"Passive","name":"Unforgiving","required-level":55,"icon":"barbarian_passive_unforgiving","description":"You no longer degenerate Fury. Instead, you gain 2 Fury every 1 seconds."},{"type":"Passive","name":"Boon of Bul-Kathos","required-level":60,"icon":"barbarian_passive_boonofbulkathos","description":"The cooldown on your Earthquake, Call of the Ancients, and Wrath of the Berserker skills is reduced by 30 seconds."}],"screenshots-count":12,"screenshots":["barb-002-index-thumb","barb-003-index-thumb","barb-004-index-thumb","barb-005-index-thumb","barb-006-index-thumb","barb-007-index-thumb","barb-008-index-thumb","barb-009-index-thumb","barb-010-index-thumb","barb-011-index-thumb","barb-012-index-thumb","barb-013-index-thumb"]},{"name":"Demon Hunter","short-description":"Ranged weaponry and shadow manipulation make this vengeful hero an elusive stalker of demons.","features":[{"name":"Ranged Weaponry","icon":"demon hunter-feature-1","description":"Demon hunters are able to pepper the battlefield with scores of arrows and projectiles, or snipe distant enemies with a precision undreamt of by other heroes. Their arsenal includes longbows, grenades, hand-thrown weapons, and even dual-wielded crossbows."},{"name":"Traps","icon":"demon hunter-feature-3","description":"When hunting packs of demons or giant horrors much stronger than themselves, canny hunters come prepared. Luring enemies into mines, caltrops, or steel-jawed traps can soften them up, ensuring an easy - and guaranteed - kill."},{"name":"Shadow Magic","icon":"demon hunter-feature-2","description":"In order to better their chances against the forces of the Burning Hells, demon hunters embrace apocryphal magics. They can cloak themselves in darkness, confound others' attacks, and slip between shadows to sneak up on their prey."},{"name":"Battle Tactics","icon":"demon hunter-feature-4","description":"Demon hunters carry the scars and burns of their pasts, and, despite the path they've chosen, they have no desire to suffer again. Hunters hold their enemies at range with hamstringing arrows, or slow them with entangling bolas, and they drop smoke bombs to escape when foes draw dangerously close."}],"resource":"Demon hunters are perpetually at war with themselves. They hold no hope for a return to their former lives, but they fight and stalk demons with a passion. Those hunters who live to train others become deliberate and cautious and, yet, their impulses scream to meet demonic violence with more violence. Every arrow that demon hunters launch is dipped in spite; nearly all of their attacks are delivered with Hatred, a cold, righteous anger that renders them utterly merciless to their enemies. Their Hatred is nearly endless; it recovers quickly, as, even at rest, demon hunters are filled with the desire for vengeance. Those hunters who would hope to make any sort of true impact must temper their Hatred with a second resource: Discipline, the caution and care that ensures they live to kill another day. Discipline is precious to demon hunters. Not only does it return slowly, requiring more reflection and patience than their Hatred-based attacks, but they must rely on it for every defensive maneuver - trapping enemies in place, vaulting out of the way of teeth and claws, and dodging hails of spines and arrows. It is a simple matter for demon hunters to stand in place, icy with Hatred, and send a volley of projectiles at the hordes of their enemies. But, when they fail to defend themselves with Discipline, hunters leave themselves able to be slaughtered. A careful balance of Discipline and Hatred is the most likely way hunters ensure their survival.","resource-type":"Hatred\/ Discipline","description":"Demon hunters are relentless vigilantes who execute their infernal targets with an arsenal of ranged weapons. They crouch and take aim far from danger, relying on bows, deadly traps, and projectiles to swiftly bring an end to the creatures that haunt their world. With sweeping blasts of shot, wide salvos of arrows and timed explosives at their disposal, demon hunters excel at devastating groups of foes who cluster together. Hunters' pinpoint accuracy also allows them to deal with stronger monsters at a distance: they can snipe at key targets or fall back while snapping off kill shots at advancing foes. However, demon hunters' focus on ranged combat and limited melee-weapons training leave them in danger when they're cornered or surrounded. Evasive skills like defensive rolls and jumps, as well as targeted attacks that hamstring and slow enemies, are as crucial to survival as any arrow in a hunter's quiver. ","lore":"Those who call themselves demon hunters are not a people or a nation. They owe allegiance to no king. They are but a remnant - an echo - of those who've lost their lives to hellspawn. When their homes are burnt and their families butchered by demons, most newly scarred refugees give up on living - but a few bury their dead, band together, and swear vengeance. Though they are small in number, hunters track and corner demons in the hopes that, if they can save even one life, their world will be better for it. At the end of a day's hunt, most still close their eyes and have nightmares in which they see the horrors that brought them together: gore-caked claws, and men and women drowning in their own blood. Awake, demon hunters see much the same. But, now, in the present, they finally have the power to retaliate. They dare not dream of victory, or, even less likely, peace. And yet, they hunt. They can do nothing else.","equipment":"Demon hunters train to hold back the darkness with unconventional combinations of weaponry and fighting styles that only they can employ. They are masters of the hand crossbow - quick-reloading, fast-firing ranged weapons that they use to turn demons into their temporary quivers. Demon hunters are so adept in the hand crossbow's use that they can dual wield them; two crossbows fired together doubles the arrows in the air and the speed at which hunters' enemies die.","tier-1":"Fledgling demon hunters wear light, flexible leather to guard their wrists and throat, and hoods to hide their faces and blend in with shadows. This may protect them from the sun, but that's about it.","tier-2":"Improved armor brings noticeable plating that's carefully crafted and form-fitting. With superior materials, even the most pragmatic hunters make minor concessions to ornamentation on their legplates and capes.","tier-3":"Mighty suits of armor boast hooks, climbing spikes, and faceplates that allow keen-eyed hunters the full range of vision while shielding their vitals. A mind-boggling number of arrows and gadgets can be secreted throughout this type of armor.","active-skills":[{"name":"Hungering Arrow","required-level":1,"icon":"demonhunter_hungeringarrow","type":"Primary","generate":3,"generate-units":"Hatred","generate-description":"","description":"Fire a magically imbued arrow that seeks out targets for 115% weapon damage and has a 35% chance to pierce through targets.","runes":[{"required-level":6,"name":"Puncturing Arrow","description":"Increase the chance for the arrow to pierce to 50%.","icon":"rune_d"},{"required-level":17,"name":"Cinder Arrow","description":"Light the arrow on fire, dealing 35% additional weapon damage as Fire over 3 seconds.","icon":"rune_a"},{"required-level":26,"name":"Shatter Shot","description":"If the arrow successfully pierces the first target, the arrow splits into 3 arrows.","icon":"rune_b"},{"required-level":42,"name":"Devouring Arrow","description":"Each consecutive pierce increases the damage of the arrow by 70%.","icon":"rune_c"},{"required-level":52,"name":"Spray of Teeth","description":"Successful Critical Hits cause a burst of bone to explode from the target, dealing 50% weapon damage to enemies in that area.","icon":"rune_e"}]},{"name":"Impale","required-level":2,"icon":"demonhunter_impale","type":"Secondary","cost":25,"cost-units":"Hatred","cost-description":"","description":"Impale a target for 265% weapon damage.","runes":[{"required-level":7,"name":"Impact","description":"Impale causes Knockback and has a 65% chance to Stun enemies for 1.5 seconds.","icon":"rune_b"},{"required-level":15,"name":"Chemical Burn","description":"Your target will also Bleed for 220% weapon damage as Physical over 2 seconds.","icon":"rune_c"},{"required-level":28,"name":"Overpenetration","description":"The knife will pierce through all enemies in a straight line.","icon":"rune_a"},{"required-level":53,"name":"Awareness","description":"After the initial throw, release multiple blades centered on you, dealing 75% weapon damage to all enemies within 10 yards.","icon":"rune_d"},{"required-level":58,"name":"Grievous Wounds","description":"Critical Hits cause 100% additional damage.","icon":"rune_e"}]},{"name":"Entangling Shot","required-level":3,"icon":"demonhunter_entanglingshot","type":"Primary","generate":3,"generate-units":"Hatred","generate-description":"","description":"Imbue an arrow with shadow energy that deals 90% weapon damage and entangles up to 2 enemies, slowing their movement by 60% for 2 seconds.","runes":[{"required-level":9,"name":"Chain Gang","description":"Hit up to 4 targets.","icon":"rune_b"},{"required-level":18,"name":"Shock Collar","description":"Strike targets with electrified chains that do an additional 70% weapon damage as Lightning over 2 seconds.","icon":"rune_c"},{"required-level":34,"name":"Heavy Burden","description":"Increase the movement slow duration to 4 seconds.","icon":"rune_a"},{"required-level":47,"name":"Justice is Served","description":"Increase the Hatred generated to 6 per shot.","icon":"rune_d"},{"required-level":54,"name":"Bounty Hunter","description":"Gain 6% of the damage dealt as Life.","icon":"rune_e"}]},{"name":"Caltrops","required-level":4,"icon":"demonhunter_caltrops","type":"Defensive","cost":6,"cost-units":"Discipline","cost-description":"","description":"Lay a trap of caltrops on the ground that activates when an enemy approaches. Once sprung, the caltrops Slow the movement of enemies within 12 yards by 60%. This trap lasts 6 seconds.","runes":[{"required-level":12,"name":"Hooked Spines","description":"Increase the slowing amount to 80%.","icon":"rune_b"},{"required-level":18,"name":"Torturous Ground","description":"When the trap is sprung, all enemies in the area are immobilized for 2 seconds.","icon":"rune_c"},{"required-level":28,"name":"Jagged Spikes","description":"Enemies in the area also take 270% weapon damage as Physical over 6 seconds.","icon":"rune_a"},{"required-level":41,"name":"Carved Stakes","description":"Reduces the cost of Caltrops to 4 Discipline.","icon":"rune_d"},{"required-level":54,"name":"Bait the Trap","description":"Become empowered while standing in the area of effect, gaining an additional 10% Critical Hit Chance with all attacks.","icon":"rune_e"}]},{"name":"Rapid Fire","required-level":5,"icon":"demonhunter_rapidfire","type":"Secondary","cost":20,"cost-units":"Hatred","cost-description":"","description":"Rapidly fire for 276% weapon damage as Physical.","runes":[{"required-level":11,"name":"Withering Fire","description":"Reduces the initial Hatred cost to 5, and ignites your arrows, causing them to deal Fire damage.","icon":"rune_d"},{"required-level":19,"name":"Web Shot","description":"Slows the movement of affected targets by 80% for 1 seconds.","icon":"rune_e"},{"required-level":32,"name":"Fire Support","description":"While channeling Rapid Fire, launch 2 homing rockets every second. Each rocket deals 35% weapon damage as Physical to nearby targets.","icon":"rune_c"},{"required-level":45,"name":"High Velocity","description":"Fire poison arrows that have a 40% chance to pierce through enemies.","icon":"rune_b"},{"required-level":56,"name":"Bombardment","description":"Rapidly fire grenades that explode for 345% weapon damage as Fire to all enemies within a 4 yard radius.","icon":"rune_a"}]},{"name":"Smoke Screen","required-level":8,"icon":"demonhunter_smokescreen","type":"Defensive","cost":14,"cost-units":"Discipline","cost-description":"","description":"Vanish behind a wall of smoke, becoming momentarily invisible for 1 seconds.","runes":[{"required-level":14,"name":"Displacement","description":"Gain 35% movement speed when activated.","icon":"rune_e"},{"required-level":23,"name":"Lingering Fog","description":"Increase the duration of the effect to 1.5 seconds.","icon":"rune_b"},{"required-level":33,"name":"Breathe Deep","description":"While invisible you gain 12 Hatred per second.","icon":"rune_c"},{"required-level":44,"name":"Special Recipe","description":"Reduce the cost to 12 Discipline.","icon":"rune_d"},{"required-level":59,"name":"Choking Gas","description":"Leave behind a cloud of gas that deals 700% weapon damage as Physical to enemies in the area over 5 seconds.","icon":"rune_a"}]},{"name":"Vault","required-level":9,"icon":"demonhunter_vault","type":"Hunting","cost":8,"cost-units":"Discipline","cost-description":"","description":"Tumble acrobatically 35 yards.","runes":[{"required-level":16,"name":"Action Shot","description":"As you travel, shoot arrows for 75% weapon damage at nearby targets.","icon":"rune_c"},{"required-level":23,"name":"Rattling Roll","description":"All enemies within 8 yards of your destination are knocked back and stunned for 1.5 seconds.","icon":"rune_e"},{"required-level":33,"name":"Tumble","description":"After using Vault, your next Vault within 6 seconds has its Discipline cost reduced by 50%.","icon":"rune_d"},{"required-level":38,"name":"Acrobatics","description":"Removes the Discipline cost but adds a 10 second cooldown.","icon":"rune_b"},{"required-level":49,"name":"Trail of Cinders","description":"Leave a trail of fire in your wake that inflicts 300% weapon damage as Fire over 3 seconds.","icon":"rune_a"}]},{"name":"Bola Shot","required-level":11,"icon":"demonhunter_bolashot","type":"Primary","generate":3,"generate-units":"Hatred","generate-description":"","description":"Shoot out an explosive bola that wraps itself around its target. After 1 second, the bola explodes dealing 160% weapon damage as Fire to the target and an additional 110% weapon damage as Fire to all other targets within 14 yards.","runes":[{"required-level":14,"name":"Volatile Explosives","description":"Increase the explosion radius to 20 yards.","icon":"rune_a"},{"required-level":24,"name":"Thunder Ball","description":"When the bola explodes, it deals 160% weapon damage as Lightning and has a 35% chance to Stun the primary target for 1.5 seconds.","icon":"rune_c"},{"required-level":37,"name":"Acid Strike","description":"Shoot 3 bolas that each deal 160% weapon damage as Poison. The bolas no longer explode for area damage to nearby targets.","icon":"rune_b"},{"required-level":51,"name":"Bitter Pill","description":"When the bola explodes, you have a 15% chance to gain 2 Discipline.","icon":"rune_d"},{"required-level":57,"name":"Imminent Doom","description":"Augment the bola to deal 216% weapon damage as Arcane to the target and 149% weapon damage as Arcane to all other targets within 14 yards, but increases the explosion delay to 2 seconds.","icon":"rune_e"}]},{"name":"Chakram","required-level":12,"icon":"demonhunter_chakram","type":"Secondary","cost":10,"cost-units":"Hatred","cost-description":"","description":"Fire a swirling Chakram that does 170% weapon damage as Physical to enemies along its path.","runes":[{"required-level":18,"name":"Twin Chakrams","description":"A second Chakram mirrors the first. Each Chakram deals 114% weapon damage as Physical.","icon":"rune_a"},{"required-level":26,"name":"Serpentine","description":"The Chakram follows a slow curve, dealing 230% weapon damage as Poison to enemies along the path.","icon":"rune_c"},{"required-level":34,"name":"Razor Disk","description":"The Chakram spirals out from the targeted location dealing 187% weapon damage as Arcane to enemies along the path.","icon":"rune_d"},{"required-level":48,"name":"Boomerang","description":"The Chakram path turns into a loop, dealing 230% weapon damage as Lightning to enemies along the path.","icon":"rune_b"},{"required-level":57,"name":"Shuriken Cloud","description":"Surround yourself with spinning Chakrams for 120 seconds, dealing 34% weapon damage per second as Physical to nearby enemies.","icon":"rune_e"}]},{"name":"Preparation","required-level":13,"icon":"demonhunter_preparation","type":"Hunting","cooldown":45,"cooldown-units":"seconds","cooldown-description":"","description":"Instantly restore all Discipline.","runes":[{"required-level":19,"name":"Invigoration","description":"Increase maximum Discipline by 10 for 5 seconds when using Preparation.","icon":"rune_b"},{"required-level":25,"name":"Punishment","description":"Restore all Hatred for 25 Discipline. Preparation has no cooldown.","icon":"rune_a"},{"required-level":35,"name":"Battle Scars","description":"Gain 60% Life after using Preparation.","icon":"rune_d"},{"required-level":44,"name":"Focused Mind","description":"Gain 45 Discipline over 15 seconds instead of restoring it immediately.","icon":"rune_c"},{"required-level":52,"name":"Backup Plan","description":"There is a 30% chance that Preparation's cooldown will not be triggered.","icon":"rune_e"}]},{"name":"Evasive Fire","required-level":14,"icon":"demonhunter_evasivefire","type":"Devices","generate":4,"generate-units":"Discipline","generate-description":"","description":"Shoot for 130% weapon damage. If an enemy is in front of you at close range, you will also backflip away 15 yards.","runes":[{"required-level":21,"name":"Hardened","description":"Instead of backflipping, your Armor is increased by 25% for 3 seconds. This does not cost Discipline.","icon":"rune_a"},{"required-level":26,"name":"Parting Gift","description":"Whenever a backflip is triggered, leave a poison bomb behind that explodes for 55% weapon damage as Poison in a 12 yard radius after 0.6 seconds. Turns Evasive Fire into Poison damage.","icon":"rune_c"},{"required-level":34,"name":"Covering Fire","description":"Shoot a spread of bolts that hit up to 3 targets for 130% weapon damage each.","icon":"rune_b"},{"required-level":42,"name":"Displace","description":"Increase the distance of the backflip to 30 yards.","icon":"rune_e"},{"required-level":53,"name":"Surge","description":"Reduces the cost of the backflip to 2 Discipline. Turns Evasive Fire into Lightning damage.","icon":"rune_d"}]},{"name":"Grenades","required-level":15,"icon":"demonhunter_grenades","type":"Primary","generate":3,"generate-units":"Hatred","generate-description":"","description":"Throw out three grenades that explode for 95% weapon damage as Fire each.","runes":[{"required-level":22,"name":"Tinkerer","description":"Increases Hatred generation to 6 Hatred.","icon":"rune_d"},{"required-level":32,"name":"Cluster Grenades","description":"Throw cluster grenades that deal 112% weapon damage as Fire over an 8 yard radius.","icon":"rune_b"},{"required-level":40,"name":"Fire Bomb","description":"Throw a single grenade that deals 124% weapon damage as Fire.","icon":"rune_c"},{"required-level":48,"name":"Stun Grenades","description":"Hurl grenades that have a 25% chance to Stun enemies for 1.5 seconds.","icon":"rune_e"},{"required-level":60,"name":"Gas Grenades","description":"Throw gas grenades that explode for 95% weapon damage as Poison and leave a cloud that deals an additional 25% weapon damage per second as Poison for 3 seconds to enemies who stand in the area.","icon":"rune_a"}]},{"name":"Shadow Power","required-level":16,"icon":"demonhunter_shadowpower","type":"Defensive","cost":14,"cost-units":"Discipline","cost-description":"","description":"Draw in the power of the shadows, gaining 15% of all damage done as Life for 5 seconds.","runes":[{"required-level":21,"name":"Night Bane","description":"Gain an additional 3 Hatred per second while Shadow Power is active.","icon":"rune_a"},{"required-level":29,"name":"Blood Moon","description":"Increases damage done as Life to 25%.","icon":"rune_e"},{"required-level":37,"name":"Well of Darkness","description":"Decreases the Discipline cost to 12.","icon":"rune_d"},{"required-level":51,"name":"Gloom","description":"Reduce incoming damage by 35% while Shadow Power is active.","icon":"rune_c"},{"required-level":58,"name":"Shadow Glide","description":"Gain 30% bonus to movement speed while Shadow Power is active.","icon":"rune_b"}]},{"name":"Fan of Knives","required-level":17,"icon":"demonhunter_fanofknives","type":"Devices","cost":20,"cost-units":"Hatred","cost-description":"","cooldown":10,"cooldown-units":"seconds","cooldown-description":"","description":"Throw knives out in a spiral around you, doing 320% weapon damage to all enemies within 10 yards of you. Your knives will also Slow the movement of enemies by 60% for 2 seconds.","runes":[{"required-level":23,"name":"Crippling Razors","description":"Increase the amount enemies are slowed to 80% for 2 seconds.","icon":"rune_d"},{"required-level":32,"name":"Retaliate","description":"Surround yourself with whirling blades that deal 464% weapon damage to all enemies if you are struck in the next 10 seconds.","icon":"rune_e"},{"required-level":38,"name":"Hail of Knives","description":"Increase the radius to damage all enemies within 20 yards.","icon":"rune_a"},{"required-level":44,"name":"Fan of Daggers","description":"Imbue your knives with a 65% chance to Stun enemies for 2 seconds.","icon":"rune_c"},{"required-level":59,"name":"Assassin's Knives","description":"Throw long-range knives that deal 70% weapon damage to 5 additional targets.","icon":"rune_b"}]},{"name":"Companion","required-level":17,"icon":"demonhunter_companion","type":"Hunting","cost":10,"cost-units":"Discipline","cost-description":"","cooldown":30,"cooldown-units":"seconds","cooldown-description":"","description":"Summon a raven companion. Your raven companion will periodically peck at enemies for 38% of your weapon damage as Physical.","runes":[{"required-level":22,"name":"Spider Companion","description":"Summon a spider instead of a raven. The spider's attacks also Slow the movement of enemies by 60% for 2 seconds.","icon":"rune_a"},{"required-level":29,"name":"Bat Companion","description":"Summon a bat instead of a raven. The bat grants you 3 Hatred per second.","icon":"rune_d"},{"required-level":41,"name":"Boar Companion","description":"Summon a boar instead of a raven. The boar increases your Life regeneration by 155 per second. In addition the boar increases your resistances to all damage types by 15%.","icon":"rune_b"},{"required-level":46,"name":"Ferret Companion","description":"Summon ferrets instead of a raven. The ferrets collect gold for you and increase gold found on monsters by 10%.","icon":"rune_e"},{"required-level":59,"name":"Wolf Companion","description":"Summon a wolf instead of a raven. The wolf attacks for 94% of your weapon damage as Physical.","icon":"rune_c"}]},{"name":"Strafe","required-level":19,"icon":"demonhunter_strafe","type":"Archery","cost":12,"cost-units":"Hatred","cost-description":"","description":"Shoot at random nearby enemies for 156% weapon damage while moving at 75% of normal movement speed.","runes":[{"required-level":24,"name":"Emberstrafe","description":"Leave a trail of fire in your wake that inflicts 65% weapon damage as Fire over 2 seconds.","icon":"rune_b"},{"required-level":29,"name":"Drifting Shadow","description":"Movement speed increased to 100% of normal running speed while strafing.","icon":"rune_d"},{"required-level":37,"name":"Stinging Steel","description":"Throw out knives rather than arrows that do an extra 100% damage on successful Critical Hits.","icon":"rune_e"},{"required-level":50,"name":"Rocket Storm","description":"In addition to regular firing, fire off homing rockets for 60% weapon damage as Fire.","icon":"rune_c"},{"required-level":56,"name":"Demolition","description":"Throw out bouncy grenades that explode for 187% weapon damage to targets within 9 yards.","icon":"rune_a"}]},{"name":"Elemental Arrow","required-level":20,"icon":"demonhunter_elementalarrow","type":"Secondary","cost":10,"cost-units":"Hatred","cost-description":"","description":"Shoot a fire arrow that deals 155% weapon damage as Fire to all targets it passes through.","runes":[{"required-level":24,"name":"Ball Lightning","description":"Fire a slow-moving arrow that electrocutes enemies along its path for 155% weapon damage as Lightning.","icon":"rune_b"},{"required-level":29,"name":"Frost Arrow","description":"Fire a frost arrow that splits into multiple arrows after hitting its target, dealing 170% weapon damage as Cold. Affected enemies have their movement speed slowed by 60% for 1 seconds.","icon":"rune_a"},{"required-level":36,"name":"Screaming Skull","description":"Grants a 40% chance to shoot a skull that will Fear affected enemies for 1.5 seconds.","icon":"rune_c"},{"required-level":43,"name":"Lightning Bolts","description":"Fire electrified bolts that Stun enemies for 1.5 seconds on a Critical Hit.","icon":"rune_e"},{"required-level":59,"name":"Nether Tentacles","description":"Shadow tentacles deal 155% weapon damage to enemies along its path and return 3% of damage dealt as Life for you.","icon":"rune_d"}]},{"name":"Marked for Death","required-level":21,"icon":"demonhunter_markedfordeath","type":"Hunting","cost":3,"cost-units":"Discipline","cost-description":"","description":"Marks an enemy. The marked enemy will take 12% additional damage for the next 30 seconds.","runes":[{"required-level":27,"name":"Contagion","description":"When the target is killed, the ability spreads to 2 other nearby targets. This effect can chain repeatedly.","icon":"rune_b"},{"required-level":31,"name":"Valley of Death","description":"Mark an area on the ground 12 yards wide for 15 seconds. Enemies in the area take 12% additional damage.","icon":"rune_c"},{"required-level":39,"name":"Grim Reaper","description":"An additional 12% of damage done to the target is also divided among all enemies within 20 yards.","icon":"rune_a"},{"required-level":48,"name":"Mortal Enemy","description":"Attacks you make against the marked target generate 3 Hatred.","icon":"rune_d"},{"required-level":60,"name":"Death Toll","description":"Heal attackers for 1% of the damage done to the marked target.","icon":"rune_e"}]},{"name":"Multishot","required-level":22,"icon":"demonhunter_multishot","type":"Archery","cost":30,"cost-units":"Hatred","cost-description":"","description":"Fire a massive volley of arrows dealing 165% weapon damage to all enemies in the area.","runes":[{"required-level":26,"name":"Fire at Will","description":"Cost reduced to 15 Hatred. Deals 165% weapon damage as Lightning.","icon":"rune_d"},{"required-level":31,"name":"Burst Fire","description":"Every time you fire, generate a shock pulse that damages nearby enemies for 65% weapon damage as Arcane.","icon":"rune_b"},{"required-level":39,"name":"Suppression Fire","description":"Every enemy hit grants 1 Discipline.","icon":"rune_e"},{"required-level":46,"name":"Full Broadside","description":"Increase the damage of Multishot to 215% weapon damage.","icon":"rune_a"},{"required-level":55,"name":"Arsenal","description":"Every use also fires 3 rockets at nearby enemies that deal 60% weapon damage as Fire each.","icon":"rune_c"}]},{"name":"Spike Trap","required-level":22,"icon":"demonhunter_spiketrap","type":"Devices","cost":30,"cost-units":"Hatred","cost-description":"","description":"Lay a trap that arms after 1.2 seconds and triggers when an enemy approaches. The trap does 275% weapon damage to all enemies within 8 yards. You can have a maximum of 3 Spike Traps active at one time.","runes":[{"required-level":27,"name":"Echoing Blast","description":"Your Spike Traps can explode up to 3 times, dealing 275% weapon damage as Poison to all enemies within 8 yards each time.","icon":"rune_b"},{"required-level":30,"name":"Sticky Trap","description":"Plant a bomb on an enemy rather than on the ground. If the target dies within 30 seconds, the bomb explodes dealing 404% weapon damage to all enemies within 16 yards.","icon":"rune_c"},{"required-level":39,"name":"Long Fuse","description":"Increases the arming time to 2 seconds but increases damage to 371% weapon damage.","icon":"rune_a"},{"required-level":46,"name":"Lightning Rod","description":"When the trap is triggered it releases a pulse of lightning that will bounce to up to 3 enemies for 275% weapon damage as Lightning.","icon":"rune_e"},{"required-level":55,"name":"Scatter","description":"Simultaneously place all 3 traps.","icon":"rune_d"}]},{"name":"Sentry","required-level":25,"icon":"demonhunter_sentry","type":"Devices","cost":30,"cost-units":"Hatred","cost-description":"","cooldown":8,"cooldown-units":"seconds","cooldown-description":"","description":"Drop a turret on the ground. The turret begins firing at nearby enemies for 175% weapon damage. Lasts 30 seconds. You may have 2 turrets active at a time.","runes":[{"required-level":28,"name":"Spitfire Turret","description":"The turret will also fire homing rockets aimed at random nearby targets for 30% weapon damage as Fire.","icon":"rune_c"},{"required-level":36,"name":"Vigilant Watcher","description":"Reduces the cooldown of Sentry to 6 seconds.","icon":"rune_b"},{"required-level":45,"name":"Chain of Torment","description":"Create a tether between you and the Sentry that does 125% weapon damage every second to every enemy it touches.","icon":"rune_a"},{"required-level":52,"name":"Aid Station","description":"Heals nearby allies for 1.0% of their maximum Life per second.","icon":"rune_d"},{"required-level":60,"name":"Guardian Turret","description":"The turret also creates a shield that reduces damage taken by allies by 15%.","icon":"rune_e"}]},{"name":"Cluster Arrow","required-level":27,"icon":"demonhunter_clusterarrow","type":"Archery","cost":50,"cost-units":"Hatred","cost-description":"","description":"Fire a cluster arrow that explodes for 225% weapon damage as Fire into a series of additional miniature bombs that explode for 100% weapon damage as Fire each.","runes":[{"required-level":33,"name":"Dazzling Arrow","description":"Enemies hit by grenades have a 55% chance to be stunned for 2 seconds and changes the damage to Physical.","icon":"rune_e"},{"required-level":36,"name":"Shooting Stars","description":"Instead of releasing grenades, shoots up to 3 rockets at nearby enemies dealing 175% weapon damage as Physical each.","icon":"rune_b"},{"required-level":41,"name":"Maelstrom","description":"Instead of releasing grenades, the cluster releases shadow energy that deals 165% weapon damage as Physical to nearby enemies. You will gain 4% of the damage done as Life.","icon":"rune_d"},{"required-level":49,"name":"Cluster Bombs","description":"Launch the cluster through the air, dropping bombs in a straight line that each explode for 230% weapon damage as Fire.","icon":"rune_c"},{"required-level":58,"name":"Loaded for Bear","description":"Increases the damage of the explosion at the impact location to 304% weapon damage as Fire.","icon":"rune_a"}]},{"name":"Rain of Vengeance","required-level":30,"icon":"demonhunter_rainofvengeance","type":"Archery","cooldown":30,"cooldown-units":"seconds","cooldown-description":"","description":"Fire a massive volley of arrows around you. Arrows fall from the sky dealing 715% weapon damage over 5 seconds to all enemies in the area.","runes":[{"required-level":35,"name":"Dark Cloud","description":"Launch a massive volley of guided arrows that rain down on enemies for 792% weapon damage over 12 seconds.","icon":"rune_b"},{"required-level":40,"name":"Beastly Bombs","description":"Summon 20 Shadow Beasts to drop bombs on enemies, dealing 245% weapon damage each.","icon":"rune_a"},{"required-level":47,"name":"Stampede","description":"Summon a wave of 10 Shadow Beasts to tear across the ground, knocking back enemies and dealing 120% weapon damage each.","icon":"rune_e"},{"required-level":54,"name":"Anathema","description":"Summon a Shadow Beast that drops grenades from the sky dealing 3300% weapon damage over 15 seconds.","icon":"rune_c"},{"required-level":60,"name":"Flying Strike","description":"A group of 8 Shadow Beasts plummet from the sky at a targeted location dealing 100% weapon damage each and stunning enemies for 2 seconds.","icon":"rune_d"}]}],"passive-skills":[{"type":"Passive","name":"Thrill of the Hunt","required-level":10,"icon":"demonhunter_passive_thrillofthehunt","description":"Every 7 seconds, your next skill that costs Hatred will immobilize your target for 2 seconds."},{"type":"Passive","name":"Tactical Advantage","required-level":10,"icon":"demonhunter_passive_tacticaladvantage","description":"Whenever you use Vault, Smoke Screen, or backflip with Evasive Fire you gain 60% movement speed for 2 seconds."},{"type":"Passive","name":"Vengeance","required-level":13,"icon":"demonhunter_passive_vengeance","description":"Your maximum Hatred is increased by 25. In addition, gain 20 Hatred and 2 Discipline whenever you are healed by a health globe."},{"type":"Passive","name":"Steady Aim","required-level":16,"icon":"demonhunter_passive_steadyaim","description":"As long as there are no enemies within 10 yards, all damage is increased by 20%."},{"type":"Passive","name":"Cull the Weak","required-level":20,"icon":"demonhunter_passive_culltheweak","description":"Damage against slowed enemies increased by 15%."},{"type":"Passive","name":"Night Stalker","required-level":20,"icon":"demonhunter_passive_nightstalker","description":"Critical Hits have a chance to restore 1 Discipline. Discipline is used to fuel many of your tactical and defensive skills."},{"type":"Passive","name":"Brooding","required-level":25,"icon":"demonhunter_passive_brooding","description":"You gain 1% of your maximum Life per second."},{"type":"Passive","name":"Hot Pursuit","required-level":27,"icon":"demonhunter_passive_hotpursuit","description":"Whenever you are at full Hatred, movement speed is increased by 15%."},{"type":"Passive","name":"Archery","required-level":30,"icon":"demonhunter_passive_archery","description":"Gain a bonus based on the weapon type of your main hand weapon:Bow: 15% increased damageCrossbow: 50% Critical Hit DamageHand Crossbow: 10% Critical Hit Chance"},{"type":"Passive","name":"Numbing Traps","required-level":30,"icon":"demonhunter_passive_numbingtraps","description":"Enemies hit by Fan of Knives, Spike Trap, Caltrops, Grenades and Sentry fire have their damage reduced by 20% for 3 seconds."},{"type":"Passive","name":"Perfectionist","required-level":35,"icon":"demonhunter_passive_perfectionist","description":"Reduces the Discipline cost of all skills by 10%. Increases your Life, Armor and all of your resistances by 10%. Discipline is used to fuel many of your tactical and defensive skills."},{"type":"Passive","name":"Custom Engineering","required-level":40,"icon":"demonhunter_passive_customengineering","description":"The duration of your Caltrops, Marked for Death, Spike Trap, and Sentry is increased by 100%. Increases the maximum number of Sentries to 3 and Spike Traps to 6."},{"type":"Passive","name":"Grenadier","required-level":45,"icon":"demonhunter_passive_grenadier","description":"Increases Hatred generated from Grenades by 2 and reduces the Hatred cost of Cluster Arrow by 10. Upon death, you drop a giant grenade that explodes for 450% weapon damage as Fire."},{"type":"Passive","name":"Sharpshooter","required-level":50,"icon":"demonhunter_passive_sharpshooter","description":"Gain 3% Critical Hit Chance every second. This bonus is reset 1 seconds after you successfully critically hit."},{"type":"Passive","name":"Ballistics","required-level":55,"icon":"demonhunter_passive_ballistics","description":"Damage from rockets increased by 50%. Rockets are fired from certain skill rune effects."}],"screenshots-count":12,"screenshots":["dh-at-the-gates-index-thumb","dh-fan-of-knives-index-thumb","dh-say-hello-to-my-little-friend-index-thumb","dh-shooting-zombie-in-the-face-index-thumb","dh-vs-skeletons-index-thumb","dh-001-index-thumb","dh-002-index-thumb","dh-003-index-thumb","dh-004-index-thumb","dh-005-index-thumb","dh-006-index-thumb","dh-007-index-thumb"]},{"name":"Monk","short-description":"Holy warrior who attacks faster than the eye can follow, disabling enemies with precision blows.","features":[{"name":"Spiritual Power","icon":"monk-feature-3","description":"As monks land subsequent attacks, they build up a reserve of Spirit that they can expend in amazing maneuvers - disorienting multiple foes, knocking groups back, or dashing in and out of melee."},{"name":"Combos","icon":"monk-feature-2","description":"Monks' melee attacks are more potent when they're used in careful succession; they generate additional spiritual energy, deal increased damage and produce unique effects that can enable a monk to defeat nearly any enemy."},{"name":"Mantras","icon":"monk-feature-1","description":"Disciplined monks can make the force of their spirit manifest, projecting it outward with a mantra, a long-lasting mantle of power which can heal or strengthen the projecting monk or any nearby allies."},{"name":"Mobility and Speed","icon":"monk-feature-4","description":"Monks possess peerless tactical mobility on the battlefield. Any monk is able to quickly move between or around enemies, flanking them or striking at their vitals as the situation demands, and defense-focused monks are more adept at dodging enemy attacks than any other class."}],"resource":"To defeat the inhuman evils they pit themselves against, monks draw upon inner reserves of Spirit, a resource that reflects their personal mastery and training. Spirit replenishes slowly. It is generated in two ways - by specific skills and attacks, and by the completion of combos. Monks who chain their attacks carefully can continue a near-endless barrage of Spirit-fueled strikes. Spirit is a valuable resource, but massive expenditures of this force allow a monk to call upon potent dodges and defensive moves, as well as monster-slaying finishing strikes. Thanks to monks' physical perfection and martial talent, they are free to deliver as many empowered strikes as their Spirit pools will allow - without waiting for ability cooldowns.'","resource-type":"Spirit","description":"Monks are sacred warriors who channel divine power through sheer force of will. Healing waves, mantras of protection and attacks empowered with holy might are all within their purview. Skilled monks deliver rapid-fire attacks unarmed or with a variety of well-balanced weapons. In combat, they emphasize high maneuverability over staying power, darting in and out of melees and avoiding protracted slugfests. Monks' attacks are primarily melee-focused. They can eliminate single foes with extreme damage, or deliver short-range area-of-effect assaults with waves of elemental power that emanate from palm strikes or crescent kicks. ","lore":"Monks of the Sahptev faith train their bodies and minds so that they may become the foremost holy warriors of the land of Ivgorod. Within the cloisters of the Patriarchs, the monks endure harsh trials both physical and spiritual, proving their devotion and attaining unmatched focus. Daily ritualistic cleansings help monks purify their spirits and overcome the corruption that gnaws at the hearts of all men. In the pursuit of martial perfection, they also hone their legendary balance and clarity, skills that allow them to master both unarmed combat and a diverse array of weapons. After a lifetime of preparation, anointed monks are permitted to leave their monasteries' halls to serve the decrees of the Patriarchs. The emblem on their foreheads marks them as survivors, achievers, and pillars of their society. Monks embody the will of Ivgorod's one thousand and one gods in every step and every strike.","equipment":"Monks' martial forms commonly incorporate specialized weaponry. Even monks' naked fists are vessels of destruction, but they can be augmented with fist weapons like the katar, a punch-dagger that's held in one or both hands and stabbed forth at the enemy. Monks are also the only heroes trained to use daibo - banded lengths of wood used to crack skulls and whirled to deflect attacks.","tier-1":"In the beginning, monks' armor is plain, cobbled together to protect their organs without being too restrictive. It's better than wandering the battlefield naked.","tier-2":"As experienced monks gain access to better craftsmanship, money and equipment, the quality of armor available to them increases substantially, incorporating personal ornamentation and fine materials.","tier-3":"Yet, even such fine armor pales in comparison to the life-saving garb of heroes, carefully chosen to enhance monks' swift fighting styles and shield them from fire, claw, and sword.","active-skills":[{"name":"Fists of Thunder","required-level":1,"icon":"monk_fistsofthunder","type":"Primary","generate":6,"generate-units":"Spirit","generate-description":"per attack","description":"Unleash a series of extremely fast punches that deal 110% weapon damage as Lightning. Every third hit deals damage to all enemies in front of you and knocks them back a short distance. Generates Spirit faster than other Spirit-generating skills due to the high attack speed.","runes":[{"required-level":6,"name":"Thunderclap","description":"Teleport to the target and release an electric shockwave with every punch that hits all enemies within 6 yards of your primary target for 35% weapon damage as Lightning.","icon":"rune_a"},{"required-level":14,"name":"Lightning Flash","description":"Increases your chance to Dodge by 16% for 2 seconds.","icon":"rune_e"},{"required-level":30,"name":"Static Charge","description":"Your primary target is charged with static electricity for 5 seconds and takes 37% weapon damage as Lightning when you attack other enemies with Fists of Thunder.","icon":"rune_c"},{"required-level":42,"name":"Quickening","description":"Critical Hits generate an additional 15 Spirit for each target hit.","icon":"rune_d"},{"required-level":52,"name":"Bounding Light","description":"Every third punch releases chain lightning instead of knocking enemies back. Each lightning strike inflicts 73% weapon damage as Lightning.","icon":"rune_b"}]},{"name":"Lashing Tail Kick","required-level":2,"icon":"monk_lashingtailkick","type":"Secondary","cost":30,"cost-units":"Spirit","cost-description":"","description":"Unleash a deadly roundhouse kick that knocks enemies back and deals 235% weapon damage.","runes":[{"required-level":7,"name":"Vulture Claw Kick","description":"Release a torrent of fire that burns nearby enemies for 259% weapon damage as Fire and causes Knockback.","icon":"rune_a"},{"required-level":15,"name":"Sweeping Armada","description":"Increases Knockback distance by 150% and slows the movement speed of struck enemies by 60% for 2 seconds.","icon":"rune_d"},{"required-level":28,"name":"Spinning Flame Kick","description":"Hurl a column of fire that burns through enemies, causing 294% weapon damage as Fire to each enemy it strikes.","icon":"rune_b"},{"required-level":38,"name":"Scorpion Sting","description":"Enemies have a 50% chance to be stunned for 1.5 seconds instead of being knocked back.","icon":"rune_e"},{"required-level":52,"name":"Hand of Ytar","description":"Attack enemies at long range, slowing the movement speed of affected targets by 80% for 2 seconds.","icon":"rune_c"}]},{"name":"Deadly Reach","required-level":3,"icon":"monk_deadlyreach","type":"Primary","generate":6,"generate-units":"Spirit","generate-description":"per attack","description":"Project lines of pure force over a short distance for 110% weapon damage. Every third hit extends 25 yards.","runes":[{"required-level":9,"name":"Piercing Trident","description":"Increases the area of effect of the second and third strikes.","icon":"rune_b"},{"required-level":18,"name":"Keen Eye","description":"The third strike increases your Armor by 50% for 4 seconds.","icon":"rune_e"},{"required-level":34,"name":"Scattered Blows","description":"The third strike is replaced with an attack that will hit up to 6 nearby enemies within 15 yards for 170% weapon damage as Lightning.","icon":"rune_c"},{"required-level":47,"name":"Strike from Beyond","description":"Critical Hits generate an additional 10 Spirit for each target hit.","icon":"rune_d"},{"required-level":54,"name":"Foresight","description":"The third strike increases the damage of all attacks by 18% for 30 seconds.","icon":"rune_a"}]},{"name":"Blinding Flash","required-level":4,"icon":"monk_blindingflash","type":"Defensive","cost":10,"cost-units":"Spirit","cost-description":"","cooldown":15,"cooldown-units":"seconds","cooldown-description":"","description":"Create a flash of light that blinds all enemies within 20 yards for 3 seconds. Elite enemies recover faster, but suffer a 30% chance to miss with attacks.","runes":[{"required-level":12,"name":"Self Reflection","description":"Increases the duration enemies are blinded to 4 seconds.","icon":"rune_d"},{"required-level":19,"name":"Blinded and Confused","description":"Blinded enemies have a 25% chance to attack each other.","icon":"rune_c"},{"required-level":28,"name":"Blinding Echo","description":"6 seconds after using Blinding Flash, a second flash of light will blind enemies within 20 yards for 0.5 seconds.","icon":"rune_b"},{"required-level":41,"name":"Searing Light","description":"Increases the chance elite enemies will miss attacks to 60%.","icon":"rune_e"},{"required-level":55,"name":"Faith in the Light","description":"For 3 seconds after using Blinding Flash, all of your attacks are empowered to deal 30% additional weapon damage as Holy.","icon":"rune_a"}]},{"name":"Tempest Rush","required-level":5,"icon":"monk_tempestrush","type":"Secondary","cost":15,"cost-units":"Spirit","cost-description":"","description":"Charge directly through your enemies, knocking them back and hobbling them, slowing their movement by 60% for 2 seconds. Also deals 85% weapon damage while running.","runes":[{"required-level":11,"name":"Northern Breeze","description":"Reduces the channeling cost of Tempest Rush to 8 Spirit.","icon":"rune_d"},{"required-level":20,"name":"Tailwind","description":"Increases the movement speed of Tempest Rush by 25%.","icon":"rune_b"},{"required-level":33,"name":"Flurry","description":"Increases the potency of the hobbling effect, slowing enemy movement by 80%.","icon":"rune_e"},{"required-level":45,"name":"Slipstream","description":"Reduces damage taken while running by 25%.","icon":"rune_c"},{"required-level":56,"name":"Bluster","description":"Enemies knocked back have their damage reduced by 20% for the duration of the effect.","icon":"rune_a"}]},{"name":"Breath of Heaven","required-level":8,"icon":"monk_breathofheaven","type":"Defensive","cost":25,"cost-units":"Spirit","cost-description":"","cooldown":15,"cooldown-units":"seconds","cooldown-description":"","description":"A blast of divine energy heals you and all allies within 12 yards for 6202 - 7442 Life.","runes":[{"required-level":14,"name":"Circle of Scorn","description":"Breath of Heaven also sears enemies for 80% weapon damage as Holy.","icon":"rune_a"},{"required-level":21,"name":"Circle of Life","description":"Increases the healing power of Breath of Heaven to 8063 - 9675 Life.","icon":"rune_b"},{"required-level":32,"name":"Blazing Wrath","description":"Breath of Heaven increases the damage of your attacks by 15% for 45 seconds.","icon":"rune_c"},{"required-level":44,"name":"Infused with Light","description":"Gain 8 additional Spirit from Spirit generating attacks for 5 seconds after using Breath of Heaven.","icon":"rune_d"},{"required-level":59,"name":"Penitent Flame","description":"Enemies exposed to Breath of Heaven run away in Fear for 1.5 seconds.","icon":"rune_e"}]},{"name":"Dashing Strike","required-level":9,"icon":"monk_dashingstrike","type":"Techniques","cost":25,"cost-units":"Spirit","cost-description":"","description":"Quickly dash at the targeted enemy or location, striking for 160% weapon damage and rooting the target for 1 second.","runes":[{"required-level":15,"name":"Way of the Falling Star","description":"After striking an enemy, your movement speed is increased 25% for 3 seconds.","icon":"rune_b"},{"required-level":23,"name":"Flying Side Kick","description":"Perform a flying kick that has a 60% chance to Stun your target for 1.5 seconds.","icon":"rune_e"},{"required-level":32,"name":"Quicksilver","description":"Reduces the cost of Dashing Strike to 10 Spirit.","icon":"rune_d"},{"required-level":39,"name":"Soaring Skull","description":"Launch yourself through the air and slow all enemies along your path by 60% for 2 seconds.","icon":"rune_a"},{"required-level":49,"name":"Blinding Speed","description":"Receive a 20% increased chance to Dodge for 3 seconds.","icon":"rune_c"}]},{"name":"Crippling Wave","required-level":11,"icon":"monk_cripplingwave","type":"Primary","generate":7,"generate-units":"Spirit","generate-description":"per attack","description":"Unleash a series of large sweeping attacks that cause 110% weapon damage to all enemies in front of you. Every third hit damages all enemies around you and dazes them, slowing their movement speed by 30% and attack speed by 20% for 3 seconds.","runes":[{"required-level":17,"name":"Mangle","description":"Increase damage to 143% weapon damage.","icon":"rune_a"},{"required-level":26,"name":"Concussion","description":"Enemies hit by Crippling Wave inflict 20% less damage for 3 seconds.","icon":"rune_c"},{"required-level":36,"name":"Rising Tide","description":"Critical Hits generate an additional 5 Spirit for each target hit.","icon":"rune_d"},{"required-level":51,"name":"Tsunami","description":"The range of Crippling Wave's third strike is increased to 17 yards and the effect of the movement speed reduction is increased to 60%.","icon":"rune_b"},{"required-level":57,"name":"Breaking Wave","description":"Enemies hit by Crippling Wave take 10% additional damage from all attacks for 3 seconds.","icon":"rune_e"}]},{"name":"Wave of Light","required-level":12,"icon":"monk_waveoflight","type":"Secondary","cost":75,"cost-units":"Spirit","cost-description":"","description":"Focuses a wave of light that crushes enemies for 390% weapon damage as Holy, followed by an additional 45% weapon damage as Holy to all enemies in a line.","runes":[{"required-level":18,"name":"Wall of Light","description":"Increases damage of the initial strike to 566% weapon damage as Holy.","icon":"rune_a"},{"required-level":25,"name":"Explosive Light","description":"Release bursts of energy that deal 430% weapon damage as Holy to nearby enemies.","icon":"rune_b"},{"required-level":35,"name":"Empowered Wave","description":"Reduces the cost of Wave of Light to 40 Spirit.","icon":"rune_d"},{"required-level":49,"name":"Blinding Light","description":"Critical Hits Stun enemies for 3 seconds.","icon":"rune_e"},{"required-level":57,"name":"Pillar of the Ancients","description":"Summon an ancient pillar that deals 280% weapon damage followed by an additional 280% weapon damage after 2 seconds.","icon":"rune_c"}]},{"name":"Exploding Palm","required-level":13,"icon":"monk_explodingpalm","type":"Techniques","cost":40,"cost-units":"Spirit","cost-description":"","description":"Cause a target to Bleed for 745% weapon damage as Physical over 9 seconds. If the target dies while bleeding, it explodes and deals 30% of the target's maximum Life as Physical damage to all nearby enemies.","runes":[{"required-level":18,"name":"The Flesh is Weak","description":"Also causes the target to take 12% additional damage for 9 seconds.","icon":"rune_c"},{"required-level":25,"name":"Strong Spirit","description":"If the target explodes after bleeding, gain 5 Spirit for each enemy caught in the blast.","icon":"rune_d"},{"required-level":36,"name":"Creeping Demise","description":"Also reduces your target's movement speed by 80% for 3 seconds.","icon":"rune_b"},{"required-level":44,"name":"Impending Doom","description":"Increases the duration of the Bleed effect to deal 745% weapon damage as Physical over 15 seconds.","icon":"rune_a"},{"required-level":51,"name":"Essence Burn","description":"Instead of bleeding, the target will burn for 745% weapon damage as Fire over 9 seconds. If the target dies while burning, it explodes causing all nearby enemies to burn for 60% weapon damage as Fire over 3 seconds. This effect can happen multiple times.","icon":"rune_e"}]},{"name":"Cyclone Strike","required-level":14,"icon":"monk_cyclonestrike","type":"Focus","cost":50,"cost-units":"Spirit","cost-description":"","description":"Pull all enemies within 24 yards towards you, followed by a furious blast of energy that deals 100% weapon damage as Holy.","runes":[{"required-level":21,"name":"Eye of the Storm","description":"Reduces the Spirit cost of Cyclone Strike to 30 Spirit.","icon":"rune_d"},{"required-level":25,"name":"Implosion","description":"Increases the distance enemies will be pulled towards you to 34 yards.","icon":"rune_b"},{"required-level":34,"name":"Sunburst","description":"Changes the blast into an explosion of fire that has a 35% chance to Fear enemies for 1.5 seconds.","icon":"rune_a"},{"required-level":41,"name":"Wall of Wind","description":"After using Cyclone Strike, gain a 20% chance to dodge attacks for 3 seconds.","icon":"rune_e"},{"required-level":55,"name":"Soothing Breeze","description":"Cyclone Strike heals you and all allies within 24 yards for 1240 Life.","icon":"rune_c"}]},{"name":"Way of the Hundred Fists","required-level":15,"icon":"monk_wayofthehundredfists","type":"Primary","generate":8,"generate-units":"Spirit","generate-description":"per attack","description":"Unleash a rapid series of punches that strikes enemies for 140% weapon damage.","runes":[{"required-level":24,"name":"Hands of Lightning","description":"Increases the number of hits in the second strike from 7 to 10.","icon":"rune_b"},{"required-level":32,"name":"Blazing Fists","description":"Critical Hits increase your attack speed and movement speed by 5% for 5 seconds. This effect can stack up to 3 times.","icon":"rune_c"},{"required-level":40,"name":"Fists of Fury","description":"Affected targets will take an additional 100% weapon damage as Holy over 5 seconds. Also adds a short dash to the first strike.","icon":"rune_a"},{"required-level":48,"name":"Spirited Salvo","description":"Every activation of the skill has a 15% chance to generate 15 additional Spirit.","icon":"rune_d"},{"required-level":60,"name":"Windforce Flurry","description":"The third strike generates a wave of wind that deals 250% weapon damage as Physical to enemies directly ahead of you.","icon":"rune_e"}]},{"name":"Serenity","required-level":16,"icon":"monk_serenity","type":"Defensive","cost":10,"cost-units":"Spirit","cost-description":"","cooldown":20,"cooldown-units":"seconds","cooldown-description":"","description":"You are enveloped in a protective shield that absorbs all incoming damage for 3 seconds and grants immunity to all control impairing effects.","runes":[{"required-level":23,"name":"Peaceful Repose","description":"When activated, Serenity heals you for 6202 - 7752 Life.","icon":"rune_a"},{"required-level":29,"name":"Reap What Is Sown","description":"When Serenity ends, the shield explodes, dealing 30% of the damage absorbed by Serenity as Holy damage to enemies within 20 yards. The damage to each enemy cannot exceed 100% of your maximum Life.","icon":"rune_e"},{"required-level":39,"name":"Tranquility","description":"Extends the protective shield to allies within 45 yards for 1 seconds, and makes them immune to control impairing effects like Slow and Frozen.","icon":"rune_d"},{"required-level":47,"name":"Ascension","description":"Increases the duration of Serenity to 4 seconds.","icon":"rune_c"},{"required-level":54,"name":"Instant Karma","description":"While Serenity is active, 50% of all projectiles and melee attacks are reflected back at the attacker.","icon":"rune_b"}]},{"name":"Seven-Sided Strike","required-level":17,"icon":"monk_sevensidedstrike","type":"Focus","cost":50,"cost-units":"Spirit","cost-description":"","cooldown":30,"cooldown-units":"seconds","cooldown-description":"","description":"Dash rapidly between nearby enemies, dealing 1777% weapon damage over 7 hits.","runes":[{"required-level":23,"name":"Sudden Assault","description":"Teleport to the target, increasing damage done to 2310% weapon damage over 7 strikes.","icon":"rune_a"},{"required-level":29,"name":"Several-Sided Strike","description":"Increases the number of strikes to 9.","icon":"rune_b"},{"required-level":37,"name":"Pandemonium","description":"Enemies hit by Seven-Sided Strike have a 25% chance to be stunned for 7 seconds by each hit.","icon":"rune_c"},{"required-level":43,"name":"Sustained Attack","description":"Reduces the cooldown of Seven-Sided Strike to 23 seconds.","icon":"rune_d"},{"required-level":60,"name":"Fulminating Onslaught","description":"Each strike explodes, dealing 254% weapon damage as Holy in a 7 yard radius around the target.","icon":"rune_e"}]},{"name":"Mantra of Evasion","required-level":19,"icon":"monk_mantraofevasion","type":"Mantras","cost":50,"cost-units":"Spirit","cost-description":"","description":"Recite a Mantra that grants you and your allies within 40 yards a 15% chance to dodge attacks for 3 minutes. For 3 seconds after activation, a second effect grants an additional 15% chance to dodge attacks. This is a Mantra. You can only have one Mantra active at a time.","runes":[{"required-level":24,"name":"Hard Target","description":"Mantra of Evasion also increases Armor by 20%.","icon":"rune_c"},{"required-level":33,"name":"Divine Protection","description":"When you or an ally under the effect of Mantra of Evasion is reduced below 25% Life, a shield of protection forms around that target, reducing damage taken by 80% for 3 seconds. Each target can be protected at most once every 90 seconds by this effect.","icon":"rune_e"},{"required-level":40,"name":"Wind through the Reeds","description":"Mantra of Evasion also increases movement speed by 8%.","icon":"rune_d"},{"required-level":50,"name":"Perseverance","description":"Mantra of Evasion also reduces the duration of all control impairing effects like Slow or Frozen by 20%.","icon":"rune_b"},{"required-level":58,"name":"Backlash","description":"Successfully dodging an attack has a chance to create a burst of flame dealing 35% weapon damage as Fire to all nearby enemies.","icon":"rune_a"}]},{"name":"Sweeping Wind","required-level":21,"icon":"monk_sweepingwind","type":"Techniques","cost":75,"cost-units":"Spirit","cost-description":"","description":"Surround yourself in a vortex that continuously deals 15% weapon damage to all enemies within 10 yards. The vortex lasts 6 seconds and is refreshed each time you strike an enemy with a melee attack. Landing a Critical Hit has a chance to increase the vortex effect up to 2 times for a total of 45% weapon damage to nearby enemies.","runes":[{"required-level":27,"name":"Master of Wind","description":"Increases the duration of the vortex to 20 seconds.","icon":"rune_e"},{"required-level":33,"name":"Blade Storm","description":"Intensify the vortex, increasing the damage per stack to 20% weapon damage. This increases the damage with 3 stacks to 60% weapon damage.","icon":"rune_a"},{"required-level":38,"name":"Fire Storm","description":"Increases the radius of the vortex to 14 yards and changes the damage dealt to Fire.","icon":"rune_b"},{"required-level":46,"name":"Inner Storm","description":"As long as your vortex is at the maximum stack count, you gain 3 Spirit per second.","icon":"rune_d"},{"required-level":56,"name":"Cyclone","description":"While your vortex is at the maximum stack count, Critical Hits have a chance to spawn a lightning tornado that periodically electrocutes nearby enemies for 20% weapon damage as Lightning. Each spawned lightning tornado lasts 3 seconds.","icon":"rune_c"}]},{"name":"Mantra of Retribution","required-level":21,"icon":"monk_mantraofretribution","type":"Mantras","cost":50,"cost-units":"Spirit","cost-description":"","description":"Recite a Mantra that causes you and your allies within 40 yards to reflect melee damage back at enemies, dealing Holy damage equal to 40% of the damage sustained. The effect lasts for 3 minutes. For 3 seconds after activation, the effect on you increases to 80% of the damage sustained. This is a Mantra. You can only have one Mantra active at a time.","runes":[{"required-level":28,"name":"Retaliation","description":"Increases the amount of damage reflected by the Mantra to 60%. The Mantra will now reflect ranged damage as well as melee damage.","icon":"rune_a"},{"required-level":36,"name":"Transgression","description":"Increases attack speed for you and your allies by 8%.","icon":"rune_b"},{"required-level":41,"name":"Indignation","description":"When taking damage from the Mantra of Retribution, enemies have a 10% chance to be stunned for 2 seconds.","icon":"rune_c"},{"required-level":56,"name":"Against All Odds","description":"When reflecting damage done to you, Mantra of Retribution has a chance to restore 3 Spirit.","icon":"rune_d"},{"required-level":59,"name":"Collateral Damage","description":"An attacker that is damaged by Mantra of Retribution has a 30% chance to suffer a feedback blast, dealing 45% weapon damage as Holy to itself and nearby enemies.","icon":"rune_e"}]},{"name":"Inner Sanctuary","required-level":22,"icon":"monk_innersanctuary","type":"Defensive","cost":30,"cost-units":"Spirit","cost-description":"","cooldown":20,"cooldown-units":"seconds","cooldown-description":"","description":"Create a runic circle of protection on the ground for 5 seconds that cannot be passed by enemies.","runes":[{"required-level":26,"name":"Safe Haven","description":"You and your allies standing in the area of effect of Inner Sanctuary regenerate 1550 Life per second.","icon":"rune_d"},{"required-level":31,"name":"Sanctified Ground","description":"When Inner Sanctuary expires, it becomes sanctified ground for 6 seconds, slowing the movement of all enemies that move through it by 60%.","icon":"rune_e"},{"required-level":37,"name":"Consecration","description":"Increases the duration of Inner Sanctuary to 7 seconds.","icon":"rune_b"},{"required-level":43,"name":"Circle of Protection","description":"You and your allies standing in the area of effect of Inner Sanctuary take 35% less damage.","icon":"rune_c"},{"required-level":58,"name":"Forbidden Palace","description":"You and your allies standing in the area of effect of Inner Sanctuary deal 10% additional damage.","icon":"rune_a"}]},{"name":"Mystic Ally","required-level":22,"icon":"monk_mystically","type":"Focus","cost":25,"cost-units":"Spirit","cost-description":"","description":"Summon a mystic ally to fight alongside you until it is destroyed. The ally deals 40% of your weapon damage as Physical per swing.","runes":[{"required-level":27,"name":"Water Ally","description":"Imbue the ally with the essence of water. The ally gains the ability to perform a wave attack that deals 120% of your weapon damage as Physical and slows the movement of affected targets by 30% for 2 seconds.","icon":"rune_b"},{"required-level":31,"name":"Fire Ally","description":"Imbue the ally with the essence of fire. The ally gains the ability to unleash a flaming kick for 80% weapon damage as Fire plus an additional 40% of your weapon damage per second as Fire for 2 seconds to all enemies in a straight line.","icon":"rune_a"},{"required-level":39,"name":"Air Ally","description":"Imbue the ally with the essence of air. Every attack made by the ally has a 2% chance to generate 100 Spirit for you. In addition, the ally is surrounded in a torrent of wind that deals 10% of your weapon damage per second as Physical to all nearby enemies.","icon":"rune_d"},{"required-level":46,"name":"Eternal Ally","description":"Imbue the ally with the essence of life. When the ally dies, it has a 50% chance to be reborn after 5 seconds. In addition, the physical damage of the ally's basic attack is increased to 44% of your weapon damage per swing.","icon":"rune_e"},{"required-level":53,"name":"Earth Ally","description":"Imbue the ally with the essence of earth. Maximum Life for you and the ally is increased by 10%. The ally also gains the ability to create a wave of earth, dealing 60% of your weapon damage as Physical to a single enemy and forcing that enemy to attack the ally for 3 seconds.","icon":"rune_c"}]},{"name":"Mantra of Healing","required-level":26,"icon":"monk_mantraofhealing","type":"Mantras","cost":50,"cost-units":"Spirit","cost-description":"","description":"Recite a Mantra that causes you and your allies within 40 yards to gain increased Life regeneration by 310 Life per second. The Mantra lasts 3 minutes. For 3 seconds after activation Mantra of Healing shrouds you and your allies with a mystical shield that absorbs up to 930 damage. This is a Mantra. You can only have one Mantra active at a time.","runes":[{"required-level":31,"name":"Sustenance","description":"Increases the Life regeneration granted by Mantra of Healing to 620 Life per second.","icon":"rune_a"},{"required-level":38,"name":"Circular Breathing","description":"Mantra of Healing also regenerates 3 Spirit per second.","icon":"rune_d"},{"required-level":42,"name":"Boon of Inspiration","description":"Mantra of Healing also heals 186 Life when hitting an enemy.","icon":"rune_b"},{"required-level":48,"name":"Heavenly Body","description":"Mantra of Healing also increases Vitality by 10%.","icon":"rune_c"},{"required-level":53,"name":"Time of Need","description":"Mantra of Healing also increases resistances to all damage types by 20%.","icon":"rune_e"}]},{"name":"Mantra of Conviction","required-level":30,"icon":"monk_mantraofconviction","type":"Mantras","cost":50,"cost-units":"Spirit","cost-description":"","description":"Recite a Mantra that causes all enemies within 20 yards of you to take 12% additional damage. The Mantra lasts 3 minutes. For 3 seconds after activation, the effect is increased to 24% additional damage. This is a Mantra. You can only have one Mantra active at a time.","runes":[{"required-level":35,"name":"Overawe","description":"Increases the strength of Mantra of Conviction so that enemies take 24% additional damage and 48% for the first 3 seconds.","icon":"rune_a"},{"required-level":44,"name":"Intimidation","description":"Enemies affected by Mantra of Conviction deal 10% less damage.","icon":"rune_e"},{"required-level":47,"name":"Dishearten","description":"Slows the movement of enemies within 20 yards by 30%.","icon":"rune_c"},{"required-level":55,"name":"Reclamation","description":"You and your allies have a 30% chance to be healed for 279 - 341 Life when using melee attacks on an enemy under the effects of Mantra of Conviction.","icon":"rune_d"},{"required-level":60,"name":"Submission","description":"Enemies affected by Mantra of Conviction take 12% weapon damage per second as Holy.","icon":"rune_b"}]}],"passive-skills":[{"type":"Passive","name":"Resolve","required-level":10,"icon":"monk_passive_resolve","description":"Damage you deal reduces enemy damage by 20% for 2.5 seconds."},{"type":"Passive","name":"Fleet Footed","required-level":10,"icon":"monk_passive_fleetfooted","description":"Increases movement speed by 10%."},{"type":"Passive","name":"Exalted Soul","required-level":13,"icon":"monk_passive_exaltedsoul","description":"Increases maximum Spirit by 100 and increases Spirit Regeneration by 1 per second. Spirit fuels your defensive and offensive abilities."},{"type":"Passive","name":"Transcendence","required-level":16,"icon":"monk_passive_transcendence","description":"Every point of Spirit spent heals you for 62.0 Life."},{"type":"Passive","name":"Chant of Resonance","required-level":20,"icon":"monk_passive_chantofresonance","description":"Duration of all Mantras increased by 7 minutes. While one of your Mantras is active you gain 2 Spirit every second."},{"type":"Passive","name":"Seize the Initiative","required-level":20,"icon":"monk_passive_seizetheinitiative","description":"Your Armor is increased by 50% of your Dexterity."},{"type":"Passive","name":"The Guardian's Path","required-level":24,"icon":"monk_passive_theguardianspath","description":"While dual-wielding, you gain a 15% chance to dodge incoming attacks. While using a two-handed weapon, all Spirit generation is increased by 35%."},{"type":"Passive","name":"Sixth Sense","required-level":27,"icon":"monk_passive_sixthsense","description":"Your dodge chance is increased by an amount equal to 30% of your Critical Hit Chance."},{"type":"Passive","name":"Pacifism","required-level":30,"icon":"monk_passive_pacifism","description":"While you are under a Stun, Fear, Immobilize or Charm effect, all damage taken is reduced by 75%."},{"type":"Passive","name":"Beacon of Ytar","required-level":35,"icon":"monk_passive_beaconofytar","description":"Reduces all cooldowns by 20%."},{"type":"Passive","name":"Guiding Light","required-level":40,"icon":"monk_passive_guidinglight","description":"Whenever you use a direct heal skill on another player you and the other player deal 16% more damage for 15 seconds."},{"type":"Passive","name":"One With Everything","required-level":45,"icon":"monk_passive_onewitheverything","description":"Your resistance to all elements is equal to your highest elemental resistance."},{"type":"Passive","name":"Combination Strike","required-level":50,"icon":"monk_passive_combinationstrike","description":"Each different Spirit Generator ability you use increases your damage by 8% for 3 seconds."},{"type":"Passive","name":"Near Death Experience","required-level":58,"icon":"monk_passive_neardeathexperience","description":"When receiving fatal damage, you are instead restored to 35% of maximum Life and 35% Spirit. This effect cannot occur more than once every 60 seconds."}],"screenshots-count":12,"screenshots":["monk-at-the-door-index-thumb","monk-attacks-a-caster-index-thumb","monk-just-kickin-it-index-thumb","monk-shows-a-zombie-his-weapon-index-thumb","monk-taking-care-of-business-index-thumb","monk-taking-off-some-heads-index-thumb","monk-vs-unburied-index-thumb","monk-001-index-thumb","monk-002-index-thumb","monk-003-index-thumb","monk-004-index-thumb","monk-005-index-thumb"]},{"name":"Witch Doctor","short-description":"Manipulator of the forces of life and death, this caster wields the power of nature in unsettling ways.","features":[{"name":"Pets","icon":"witch doctor-feature-1","description":"Witch doctors are surrounded by hordes of things - mongrels, zombies, bats, fetishes, spiders and more. Many of these creatures stand beside their masters and fight until they are slain, serving as convenient targets in the meantime."},{"name":"Destructive Magic","icon":"witch doctor-feature-2","description":"Witch doctors command frightful magics that damage groups of enemies with clouds of acid, gouts of flame and swarms of locusts. They can even sacrifice the bodies of their pets to ravage their foes in a wave of bony shrapnel."},{"name":"Curses and Hexes","icon":"witch doctor-feature-3","description":"Weakening and slow-killing hexes can help soften and invalidate even the most terrible of the Burning Hells's minions. Witch doctors employ a number of these curses, including debilitating poisons and bolts of spirit energy that steal life and vitality."},{"name":"Battlefield Control","icon":"witch doctor-feature-4","description":"Those who battle witch doctors find their bodies and minds twisted, limiting their effectiveness in combat. The enemies of the Unformed Land are held in place by ghastly undead hands, transformed into chickens, and sent fleeing in fear or striking at their fellows in utter bewilderment."}],"resource":"Witch doctors' inborn connection to the Unformed Land allows them to tap into a deep well of spiritual energy, called Mana. Mana is a vast but slowly-regenerating resource; witch doctors must be choosy with their attack spells and hexes to ensure that they don't leave themselves depleted of power and exposed to enemy attacks. Since Mana returns ponderously, witch doctors conserve it by relying on semi-permanent additions to their arsenal, such as their summoned mongrels and the horrific gargantuan, which can offer protection and chew through enemies without any further mana cost. Witch doctors have a sizeable reservoir of energy to call upon at once, and, when they need to, they can deploy immense blasts of destructive force and cut a swath across nearly any battleground in a short period of time.","resource-type":"Mana","description":"Witch doctors are spiritual warriors who summon dead souls and crawling creatures to do their bidding. By surrounding themselves with conjured zombies and vermin, witch doctors are free to assault their enemies with exploding skulls, acrid poison clouds, and wasting curses. The ability to infect, slow and terrify their enemies gives witch doctors unprecedented control over a battlefield. They can manipulate opposing attacks and movements with debuffs and crowd control spells, rendering enemies easy prey for hungry pets. Witch doctors can also lay down fields of fire and venom that slowly leech life from advancing foes. Although some witch doctors avoid melee combat in favor of augmenting their pets and crippling their enemies from afar, they are also more than capable of slaying weakened foes with their own hands. ","lore":"Only a select few men and women among the umbaru tribes can ascend to the hallowed role of witch doctor, for they must possess both a history of battle and a talent for communing with spirits. The latter ability belongs solely to those born with the touch of the Unformed Land - the invisible realm where the umbaru believe the spirits of the dead dwell once they have left Sanctuary behind. When a man dies, witch doctors feel what they suspect is the breath of life leaving his cooling body. And, when calamity or genocide sends hundreds to their graves at once, witch doctors can sense their trembling and shrieking from beyond. Witch doctors cannot cover their ears to the voices of the spirits. As the sounds of disquiet grow louder, their choice is made. They must restore the balance between their world and the Unformed Land, or watch the torment of generations past for the rest of their lives... and forever after.","equipment":"Though witch doctors make use of a variety of weaponry, they boast several one-of-a-kind pieces of equipment. Mojos are fragile talismans held in the off-hand; instead of being used directly as weapons, they aid witch doctors in warding off the wrong dark forces...and calling out to the right ones. Witch doctors have also been known to carry enchanted ceremonial daggers. Unlike common knives, these blades are honed towards one purpose - human sacrifice - and so they are well-suited to ending lives.","tier-1":"The paint covering novice witch doctors' bodies almost serves as better protection than the fur and cloth they gird themselves with.","tier-2":"Experienced witch doctors are able to piece together superior defenses, augmenting their armor with fine metal plates and wicked-looking masks.","tier-3":"Well-girded witch doctors strike fear in the hearts of their foes with armor covered in ancient skulls, feathers and horns. They're also hard to kill, thanks to sharp body plating and custom shoulder guards.","active-skills":[{"name":"Poison Dart","required-level":1,"icon":"witchdoctor_poisondart","type":"Primary","cost":10,"cost-units":"Mana","cost-description":"","description":"Shoot a deadly Poison Dart that deals 100% weapon damage as Poison and an additional 40% weapon damage as Poison over 2 seconds.","runes":[{"required-level":6,"name":"Splinters","description":"Shoot 3 Poison Darts that deal 60% weapon damage as Poison each.","icon":"rune_b"},{"required-level":13,"name":"Numbing Dart","description":"Toxins in the Poison Dart reduce the target's movement speed by 60% for 2 seconds.","icon":"rune_c"},{"required-level":25,"name":"Spined Dart","description":"Gain 29 Mana every time a Poison Dart hits an enemy.","icon":"rune_d"},{"required-level":43,"name":"Flaming Dart","description":"Ignite the dart so that it deals 180% weapon damage as Fire at once.","icon":"rune_a"},{"required-level":52,"name":"Snake to the Face","description":"Transform your Poison Dart into a snake that has a 30% chance to Stun the enemy for 1.5 seconds.","icon":"rune_e"}]},{"name":"Grasp of the Dead","required-level":2,"icon":"witchdoctor_graspofthedead","type":"Secondary","cost":123,"cost-units":"Mana","cost-description":"","cooldown":8,"cooldown-units":"seconds","cooldown-description":"","description":"Ghoulish hands reach out from the ground, slowing enemy movement by 60% and dealing 320% weapon damage as Physical over 8 seconds.","runes":[{"required-level":7,"name":"Unbreakable Grasp","description":"Increases the Slow amount to 80%.","icon":"rune_c"},{"required-level":15,"name":"Groping Eels","description":"Increases the damage done to 416% weapon damage as Physical.","icon":"rune_a"},{"required-level":25,"name":"Death Is Life","description":"Enemies who die while in the area of Grasp of the Dead have a 10% chance to produce a health globe or summon a Zombie Dog.","icon":"rune_e"},{"required-level":28,"name":"Desperate Grasp","description":"Reduces the cooldown of Grasp of the Dead to 6 seconds.","icon":"rune_d"},{"required-level":53,"name":"Rain of Corpses","description":"Corpses fall from the sky, dealing 80% weapon damage as Physical over 8 seconds to nearby enemies.","icon":"rune_b"}]},{"name":"Corpse Spiders","required-level":3,"icon":"witchdoctor_corpsespider","type":"Primary","cost":5,"cost-units":"Mana","cost-description":"","description":"Throw a jar with 4 spiders that attack nearby enemies for a total of 120% weapon damage as Physical before dying.","runes":[{"required-level":9,"name":"Leaping Spiders","description":"Summon jumping spiders that leap up to 25 yards to reach their target and attack for a total of 144% weapon damage as Physical.","icon":"rune_c"},{"required-level":18,"name":"Spider Queen","description":"Summon a spider queen that births spiderlings, dealing 630% weapon damage as Poison over 15 seconds.You may only have one spider queen summoned at a time.","icon":"rune_b"},{"required-level":33,"name":"Widowmakers","description":"Summon widowmaker spiders that return 4 Mana to you per hit.","icon":"rune_d"},{"required-level":45,"name":"Medusa Spiders","description":"Summon paralyzing spiders that have a 25% chance to Slow enemies' movement by 60% with every attack.","icon":"rune_e"},{"required-level":55,"name":"Blazing Spiders","description":"Summon fire spiders that deal a total of 156% weapon damage as Fire.","icon":"rune_a"}]},{"name":"Summon Zombie Dogs","required-level":4,"icon":"witchdoctor_summonzombiedog","type":"Defensive","cost":49,"cost-units":"Mana","cost-description":"","cooldown":45,"cooldown-units":"seconds","cooldown-description":"","description":"Summon 3 Zombie Dogs from the depths to fight by your side. Each dog deals 9% of your weapon damage as Physical per hit.","runes":[{"required-level":12,"name":"Rabid Dogs","description":"Your Zombie Dogs gain an infectious bite that deals 9% of your weapon damage as Poison over 3 seconds.","icon":"rune_c"},{"required-level":19,"name":"Final Gift","description":"Your Zombie Dogs have a 15% chance to leave behind a health globe when they die.","icon":"rune_d"},{"required-level":28,"name":"Life Link","description":"Your Zombie Dogs absorb 10% of all damage done to you.","icon":"rune_b"},{"required-level":40,"name":"Burning Dogs","description":"Your Zombie Dogs burst into flames, burning nearby enemies for 2% of your weapon damage as Fire every second.","icon":"rune_a"},{"required-level":54,"name":"Leeching Beasts","description":"Your Zombie Dogs heal 50% of the damage they deal as Life divided evenly between themselves and you.","icon":"rune_e"}]},{"name":"Firebats","required-level":5,"icon":"witchdoctor_firebats","type":"Secondary","cost":98,"cost-units":"Mana","cost-description":"","description":"Call forth a swarm of fiery bats to burn enemies in front of you for 180% weapon damage as Fire.","runes":[{"required-level":11,"name":"Dire Bats","description":"Summon fewer but larger bats that travel up to 40 yards and hit for 220% weapon damage as Fire.","icon":"rune_a"},{"required-level":19,"name":"Vampire Bats","description":"Gain 2.5% of damage done by the bats as Life.","icon":"rune_d"},{"required-level":29,"name":"Plague Bats","description":"Diseased bats fly towards the enemy and infect them. Damage is slow at first, but can increase over time to a maximum of 270% weapon damage as Poison.","icon":"rune_c"},{"required-level":45,"name":"Hungry Bats","description":"Rapidly summon bats that seek out nearby enemies for 350% weapon damage as Fire.","icon":"rune_b"},{"required-level":56,"name":"Cloud of Bats","description":"Call forth a swirl of bats that damage nearby enemies for 234% weapon damage as Fire. The damage of the bats increases by 20% every second, up to a maximum of 100%.","icon":"rune_e"}]},{"name":"Horrify","required-level":8,"icon":"witchdoctor_horrify","type":"Defensive","cost":37,"cost-units":"Mana","cost-description":"","cooldown":16,"cooldown-units":"seconds","cooldown-description":"","description":"Don a spectral mask that horrifies all enemies within 12 yards, causing them to run in Fear for 4 seconds.","runes":[{"required-level":14,"name":"Phobia","description":"Increases the duration horrified enemies run in Fear to 6 seconds.","icon":"rune_c"},{"required-level":21,"name":"Stalker","description":"Increases movement speed by 20% for 4 seconds after casting Horrify.","icon":"rune_e"},{"required-level":34,"name":"Face of Death","description":"Increases the radius of Horrify to 24 yards.","icon":"rune_b"},{"required-level":44,"name":"Frightening Aspect","description":"Gain 100% additional Armor for 8 seconds after casting Horrify.","icon":"rune_a"},{"required-level":56,"name":"Ruthless Terror","description":"Gain 27 Mana for every horrified enemy.","icon":"rune_d"}]},{"name":"Soul Harvest","required-level":9,"icon":"witchdoctor_soulharvest","type":"Terror","cost":59,"cost-units":"Mana","cost-description":"","cooldown":15,"cooldown-units":"seconds","cooldown-description":"","description":"Feed on the life force of up to 5 enemies within 16 yards. Gain 130 Intelligence for each affected enemy. This effect lasts 30 seconds.","runes":[{"required-level":15,"name":"Swallow Your Soul","description":"Gain 39 Mana for every enemy harvested.","icon":"rune_d"},{"required-level":21,"name":"Siphon","description":"Gain 2171 Life for every enemy harvested.","icon":"rune_a"},{"required-level":32,"name":"Languish","description":"Reduces the movement speed of harvested enemies by 80% for 3 seconds.","icon":"rune_c"},{"required-level":39,"name":"Soul to Waste","description":"Increase the duration of Soul Harvest's effect to 60 seconds.","icon":"rune_b"},{"required-level":49,"name":"Vengeful Spirit","description":"Harvested enemies also take 230% weapon damage as Physical.","icon":"rune_e"}]},{"name":"Plague of Toads","required-level":11,"icon":"witchdoctor_plagueoftoads","type":"Primary","cost":12,"cost-units":"Mana","cost-description":"","description":"Release a handful of toads that deal 130% weapon damage as Poison to enemies they come in contact with.","runes":[{"required-level":17,"name":"Explosive Toads","description":"Mutate to fire bullfrogs that explode for 169% weapon damage as Fire.","icon":"rune_a"},{"required-level":24,"name":"Toad of Hugeness","description":"Summon a giant toad that swallows enemies whole for up to 5 seconds, digesting for 20% of your weapon damage per second as Physical. Adds a 5 second cooldown to Plague of Toads.","icon":"rune_c"},{"required-level":35,"name":"Rain of Toads","description":"Cause toads to rain from the sky that deal 130% weapon damage as Poison to enemies in the area over 2 seconds.","icon":"rune_b"},{"required-level":51,"name":"Addling Toads","description":"Mutate to yellow frogs that deal 130% weapon damage as Poison and have a 15% chance to Confuse affected enemies for 4 seconds.","icon":"rune_e"},{"required-level":54,"name":"Toad Affinity","description":"Removes the Mana cost of Plague of Toads.","icon":"rune_d"}]},{"name":"Haunt","required-level":12,"icon":"witchdoctor_haunt","type":"Secondary","cost":98,"cost-units":"Mana","cost-description":"","description":"Haunt an enemy with a spirit, dealing 575% weapon damage as Arcane over 6 seconds. If the target dies, the spirit will haunt another nearby enemy.","runes":[{"required-level":18,"name":"Consuming Spirit","description":"The spirit returns 155 Life per second.","icon":"rune_a"},{"required-level":23,"name":"Resentful Spirit","description":"Summon a vengeful spirit that does 383% weapon damage as Arcane over 2 seconds.","icon":"rune_e"},{"required-level":35,"name":"Lingering Spirit","description":"If there are no targets left, the spirit will linger for up to 10 seconds looking for new enemies.","icon":"rune_b"},{"required-level":48,"name":"Grasping Spirit","description":"Slow the movement of haunted targets by 30%.","icon":"rune_c"},{"required-level":57,"name":"Draining Spirit","description":"The spirit returns 20.4 Mana per second.","icon":"rune_d"}]},{"name":"Sacrifice","required-level":13,"icon":"witchdoctor_sacrifice","type":"Terror","description":"Banish your Zombie Dogs and cause them to explode, each dealing 275% of your weapon damage as Physical to all enemies within 12 yards.","runes":[{"required-level":18,"name":"Black Blood","description":"Ichor erupts from the corpses of the Zombie Dogs and Slows enemies by 60% for 8 seconds.","icon":"rune_c"},{"required-level":24,"name":"Next of Kin","description":"Each Zombie Dog you sacrifice has a 35% chance to resurrect as a new Zombie Dog.","icon":"rune_e"},{"required-level":36,"name":"Pride","description":"Regain 294 Mana for each Zombie Dog you sacrifice.","icon":"rune_d"},{"required-level":41,"name":"For the Master","description":"Gain 6202 Life for each Zombie Dog you sacrifice.","icon":"rune_b"},{"required-level":51,"name":"Provoke the Pack","description":"Each sacrificed Zombie Dog increases your damage by 5% for 30 seconds.","icon":"rune_a"}]},{"name":"Zombie Charger","required-level":14,"icon":"witchdoctor_zombiecharger","type":"Decay","cost":140,"cost-units":"Mana","cost-description":"","description":"Call forth a reckless, suicidal zombie that deals 205% weapon damage as Poison to all enemies in its path before decomposing.","runes":[{"required-level":21,"name":"Leperous Zombie","description":"The Zombie Charger leaves behind a cloud of noxious vapors that deals 240% weapon damage as Poison over 3 seconds to enemies caught in it.","icon":"rune_c"},{"required-level":27,"name":"Undeath","description":"If the Zombie Charger kills any enemies, it will reanimate and charge nearby enemies for 205% weapon damage as Poison. This effect can repeat up to 2 times.","icon":"rune_d"},{"required-level":33,"name":"Wave of Zombies","description":"Summon 3 Zombie Chargers that each deal 115% weapon damage as Poison.","icon":"rune_b"},{"required-level":42,"name":"Explosive Beast","description":"Summon an explosive Zombie Dog that streaks toward your target before exploding, dealing 236% weapon damage as Fire to all enemies within 9 yards.","icon":"rune_e"},{"required-level":54,"name":"Zombie Bears","description":"Summon zombie bears that stampede towards your target. Each bear deals 236% weapon damage as Poison to enemies in the area.","icon":"rune_a"}]},{"name":"Spirit Walk","required-level":16,"icon":"witchdoctor_spiritwalk","type":"Defensive","cost":49,"cost-units":"Mana","cost-description":"","cooldown":15,"cooldown-units":"seconds","cooldown-description":"","description":"Leave your physical body and enter the spirit realm for 2 seconds. While in the spirit realm, your movement is unhindered. Your link to the spirit realm will end if your physical body sustains 50% of your maximum Life in damage.","runes":[{"required-level":23,"name":"Jaunt","description":"Increases the duration of Spirit Walk to 3 seconds.","icon":"rune_b"},{"required-level":29,"name":"Honored Guest","description":"Gain 15% of your maximum Mana every second while Spirit Walk is active.","icon":"rune_d"},{"required-level":38,"name":"Umbral Shock","description":"When Spirit Walk ends, your physical body erupts for 310% weapon damage as Fire to all enemies within 10 yards.","icon":"rune_c"},{"required-level":47,"name":"Severance","description":"Damage enemies you walk through in spirit form for 225% weapon damage as Physical every second for 2 seconds.","icon":"rune_a"},{"required-level":53,"name":"Healing Journey","description":"Gain 7% of your maximum Life every second while Spirit Walk is active.","icon":"rune_e"}]},{"name":"Spirit Barrage","required-level":17,"icon":"witchdoctor_spiritbarrage","type":"Decay","cost":108,"cost-units":"Mana","cost-description":"","description":"Bombard a target with a spirit blast that deals 230% weapon damage as Physical.","runes":[{"required-level":23,"name":"The Spirit Is Willing","description":"Gain 44 Mana every time Spirit Barrage hits.","icon":"rune_d"},{"required-level":32,"name":"Well of Souls","description":"An additional 3 spirits seek out other targets and deal 65% weapon damage as Physical.","icon":"rune_b"},{"required-level":37,"name":"Phantasm","description":"Summon a spectre that deals 225% weapon damage as Physical over 5 seconds to all enemies within 10 yards.","icon":"rune_c"},{"required-level":44,"name":"Phlebotomize","description":"Regain 3% of damage dealt with Spirit Barrage as Life.","icon":"rune_a"},{"required-level":59,"name":"Manitou","description":"Summon a spectre that hovers over you, unleashing spirit bolts at nearby enemies for 1667% weapon damage as Physical over 20 seconds.","icon":"rune_e"}]},{"name":"Gargantuan","required-level":19,"icon":"witchdoctor_gargantuan","type":"Voodoo","cost":147,"cost-units":"Mana","cost-description":"","cooldown":60,"cooldown-units":"seconds","cooldown-description":"","description":"Summon a Gargantuan zombie to fight for you. The Gargantuan attacks for 100% of your weapon damage as Physical.","runes":[{"required-level":22,"name":"Humongoid","description":"The Gargantuan gains the Cleave ability, allowing its attacks to hit multiple targets for 130% of your weapon damage as Physical.","icon":"rune_b"},{"required-level":29,"name":"Restless Giant","description":"When the Gargantuan encounters an elite enemy or is near 5 enemies, it enrages for 15 seconds gaining:20% movement speed35% attack speed200% Physical damageThis effect cannot occur more than once every 120 seconds. Elite enemies include champions, rares, bosses, and other players.","icon":"rune_a"},{"required-level":39,"name":"Wrathful Protector","description":"Summon a more powerful Gargantuan that only lasts for 15 seconds. The Gargantuan's fists burn with fire, dealing 110% of your weapon damage as Fire and knocking enemies back.","icon":"rune_d"},{"required-level":48,"name":"Big Stinker","description":"The Gargantuan is surrounded by a poison cloud that deals 15% weapon damage as Poison per second to nearby enemies.","icon":"rune_c"},{"required-level":56,"name":"Bruiser","description":"The Gargantuan gains the ability to periodically slam enemies, dealing 200% of your weapon damage as Physical and stunning them for 3 seconds.","icon":"rune_e"}]},{"name":"Locust Swarm","required-level":21,"icon":"witchdoctor_locust_swarm","type":"Secondary","cost":196,"cost-units":"Mana","cost-description":"","description":"Unleash a plague of locusts that swarms an enemy, dealing 360% weapon damage as Poison over 8 seconds. The locusts will jump to additional nearby enemies.","runes":[{"required-level":27,"name":"Pestilence","description":"Locust Swarm has a 100% chance to jump to two additional targets instead of one.","icon":"rune_b"},{"required-level":33,"name":"Devouring Swarm","description":"Gain 37 Mana for every enemy affected by the swarm.","icon":"rune_d"},{"required-level":37,"name":"Cloud of Insects","description":"Increases the duration of the swarm to 10 seconds.","icon":"rune_c"},{"required-level":42,"name":"Diseased Swarm","description":"Enemies killed by Locust Swarm leave behind a cloud of locusts that deal 75% weapon damage as Poison over 3 seconds to enemies who stand in the area.","icon":"rune_e"},{"required-level":59,"name":"Searing Locusts","description":"Engulf the target with burning locusts that deal 468% weapon damage as Fire over 8 seconds.","icon":"rune_a"}]},{"name":"Firebomb","required-level":21,"icon":"witchdoctor_firebomb","type":"Primary","cost":10,"cost-units":"Mana","cost-description":"","description":"Lob an explosive skull that deals 110% weapon damage as Fire to all enemies within 8 yards.","runes":[{"required-level":28,"name":"Flash Fire","description":"Rather than exploding for area damage, each Firebomb can bounce to up to 6 additional targets. Damage is reduced by 15% per bounce.","icon":"rune_e"},{"required-level":31,"name":"Roll the Bones","description":"Allows the skull to bounce up to 2 times.","icon":"rune_b"},{"required-level":38,"name":"Fire Pit","description":"The explosion creates a pool of fire that deals 36% weapon damage as Fire over 3 seconds.","icon":"rune_c"},{"required-level":47,"name":"Pyrogeist","description":"Create a column of flame that spews fire at the closest enemy for 640% weapon damage as Fire over 6 seconds. You may only have one Pyrogeist active at a time.","icon":"rune_d"},{"required-level":60,"name":"Ghost Bomb","description":"In addition to the base explosion, the skull creates a larger blast that deals an additional 30% weapon damage as Fire to all enemies within 28 yards.","icon":"rune_a"}]},{"name":"Hex","required-level":22,"icon":"witchdoctor_hex","type":"Defensive","cost":49,"cost-units":"Mana","cost-description":"","cooldown":15,"cooldown-units":"seconds","cooldown-description":"","description":"Summon a Fetish Shaman for 12 seconds that will hex enemies into chickens. Hexed enemies are unable to perform offensive actions and take 10% additional damage.","runes":[{"required-level":26,"name":"Hedge Magic","description":"The Fetish Shaman will periodically heal allies for 1861 Life.","icon":"rune_d"},{"required-level":31,"name":"Jinx","description":"Hexed targets take 20% additional damage.","icon":"rune_e"},{"required-level":36,"name":"Angry Chicken","description":"Transform into an angry chicken for up to 5 seconds that can explode for 215% weapon damage as Physical to all enemies within 12 yards.","icon":"rune_b"},{"required-level":43,"name":"Painful Transformation","description":"Hex causes the target to Bleed for 12% weapon damage as Physical.","icon":"rune_a"},{"required-level":58,"name":"Unstable Form","description":"Hexed targets explode when killed, dealing 135% weapon damage as Poison to all enemies within 8 yards.","icon":"rune_c"}]},{"name":"Acid Cloud","required-level":22,"icon":"witchdoctor_acidcloud","type":"Decay","cost":172,"cost-units":"Mana","cost-description":"","description":"Cause acid to rain down, dealing an initial 115% weapon damage as Poison, followed by 150% weapon damage as Poison over 3 seconds to enemies who remain in the area.","runes":[{"required-level":26,"name":"Acid Rain","description":"Increases the initial area of effect of Acid Cloud to 24 yards.","icon":"rune_b"},{"required-level":30,"name":"Lob Blob Bomb","description":"The acid on the ground forms into a slime that irradiates nearby enemies for 250% weapon damage as Poison over 5 seconds.","icon":"rune_c"},{"required-level":39,"name":"Slow Burn","description":"Increases the duration of the acid pools left behind to deal 300% weapon damage as Poison over 6 seconds.","icon":"rune_d"},{"required-level":46,"name":"Kiss of Death","description":"Spit a cloud of acid that inflicts 127% weapon damage as Poison, followed by 165% weapon damage as Poison over 3 seconds.","icon":"rune_e"},{"required-level":55,"name":"Corpse Bomb","description":"Raise a corpse from the ground that explodes for 230% weapon damage as Poison to enemies in the area.","icon":"rune_a"}]},{"name":"Mass Confusion","required-level":22,"icon":"witchdoctor_massconfusion","type":"Terror","cost":74,"cost-units":"Mana","cost-description":"","cooldown":60,"cooldown-units":"seconds","cooldown-description":"","description":"Incite paranoia in enemies, confusing them and causing some to fight for you for 12 seconds.","runes":[{"required-level":26,"name":"Unstable Realm","description":"Reduces the cooldown of Mass Confusion to 45 seconds.","icon":"rune_d"},{"required-level":34,"name":"Devolution","description":"Enemies killed while Confused have a 50% chance of spawning a Zombie Dog.","icon":"rune_e"},{"required-level":43,"name":"Mass Hysteria","description":"Up to 6 enemies who aren't Confused are Stunned for 3 seconds.","icon":"rune_b"},{"required-level":46,"name":"Paranoia","description":"All enemies in the area of Mass Confusion take 20% additional damage for 12 seconds.","icon":"rune_a"},{"required-level":54,"name":"Mass Hallucination","description":"Amid the confusion, a giant spirit rampages through enemies, dealing 22% weapon damage per second as Physical to enemies it passes through.","icon":"rune_c"}]},{"name":"Big Bad Voodoo","required-level":25,"icon":"witchdoctor_bigbadvoodoo","type":"Voodoo","cooldown":120,"cooldown-units":"seconds","cooldown-description":"","description":"Conjure a Fetish that begins a ritual dance that increases the attack speed and movement speed of all nearby allies by 20% for 20 seconds.","runes":[{"required-level":31,"name":"Jungle Drums","description":"Increases the duration of the ritual to 30 seconds.","icon":"rune_b"},{"required-level":37,"name":"Rain Dance","description":"The ritual restores 123 Mana per second while standing in the ritual area.","icon":"rune_d"},{"required-level":44,"name":"Slam Dance","description":"The Fetish increases the damage of all nearby allies by 30%.","icon":"rune_a"},{"required-level":50,"name":"Ghost Trance","description":"The ritual heals all nearby allies for 5% of their maximum Life per second.","icon":"rune_c"},{"required-level":58,"name":"Boogie Man","description":"Enemies who die in the ritual area have a 50% chance to resurrect as a Zombie Dog.","icon":"rune_e"}]},{"name":"Wall of Zombies","required-level":28,"icon":"witchdoctor_wallofzombies","type":"Decay","cost":103,"cost-units":"Mana","cost-description":"","cooldown":20,"cooldown-units":"seconds","cooldown-description":"","description":"Raise a line of zombies from the ground that attacks nearby enemies for 800% weapon damage as Physical over 5 seconds.","runes":[{"required-level":32,"name":"Barricade","description":"Increases the width of the Wall of Zombies.","icon":"rune_b"},{"required-level":35,"name":"Unrelenting Grip","description":"Your Wall of Zombies will Slow the movement of enemies by 60% for 5 seconds.","icon":"rune_d"},{"required-level":41,"name":"Creepers","description":"Up to 3 zombies will emerge from the ground and attack nearby enemies for 25% of your weapon damage as Physical per attack.","icon":"rune_a"},{"required-level":49,"name":"Pile On","description":"Summon a tower of zombies that falls over, dealing 550% weapon damage as Physical to any enemies it hits and knocks them back. Reduces the cooldown to 10 seconds.","icon":"rune_e"},{"required-level":60,"name":"Dead Rush","description":"Zombies crawl out of the ground and run in all directions, dealing 445% weapon damage as Physical to nearby enemies.","icon":"rune_c"}]},{"name":"Fetish Army","required-level":30,"icon":"witchdoctor_fetisharmy","type":"Voodoo","cooldown":120,"cooldown-units":"seconds","cooldown-description":"","description":"Summon an army of dagger-wielding Fetishes to fight by your side for 20 seconds. The Fetishes attack for 20% of your weapon damage as Physical.","runes":[{"required-level":34,"name":"Fetish Ambush","description":"Each Fetish deals 250% weapon damage as Physical to any nearby enemy as it is summoned.","icon":"rune_a"},{"required-level":40,"name":"Devoted Following","description":"Decreases the cooldown of Fetish Army to 90 seconds.","icon":"rune_d"},{"required-level":46,"name":"Legion of Daggers","description":"Increases number of dagger-wielding Fetishes summoned by 3.","icon":"rune_b"},{"required-level":52,"name":"Tiki Torchers","description":"Summon an additional 2 Fetish casters who breathe fire in a cone in front of them that deals 15% of your weapon damage as Fire.","icon":"rune_c"},{"required-level":60,"name":"Head Hunters","description":"Summon an additional 2 Hunter Fetishes that shoot blowdarts at enemies, dealing 20% of your weapon damage as Poison.","icon":"rune_e"}]}],"passive-skills":[{"type":"Passive","name":"Jungle Fortitude","required-level":10,"icon":"witchdoctor_passive_junglefortitude","description":"Reduces all damage taken by you and your pets by 15%."},{"type":"Passive","name":"Circle of Life","required-level":10,"icon":"witchdoctor_passive_circleoflife","description":"Whenever an enemy dies within 12 yards, there is a 30% chance that a Zombie Dog will automatically emerge. The range of this effect is increased by items that increase your gold pickup radius."},{"type":"Passive","name":"Spiritual Attunement","required-level":13,"icon":"witchdoctor_passive_spiritualattunement","description":"Maximum Mana is increased by 20%. Regenerate 1% of your maximum Mana per second. Mana is the fuel you use to cast offensive and defensive skills."},{"type":"Passive","name":"Gruesome Feast","required-level":16,"icon":"witchdoctor_passive_gruesomefeast","description":"Whenever you are healed by a health globe, you gain 10% of your maximum Mana and 10% Intelligence for 10 seconds. The Intelligence bonus can stack up to 5 times."},{"type":"Passive","name":"Blood Ritual","required-level":20,"icon":"witchdoctor_passive_bloodritual","description":"15% of Mana costs are paid with Life. In addition, you regenerate 1% of your maximum Life per second."},{"type":"Passive","name":"Bad Medicine","required-level":20,"icon":"witchdoctor_passive_badmedicine","description":"Whenever you deal Poison damage to an enemy, their damage is reduced by 20% for 3 seconds."},{"type":"Passive","name":"Zombie Handler","required-level":24,"icon":"witchdoctor_passive_zombiehandler","description":"You can have 4 Zombie Dogs summoned at one time. The health of your Zombie Dogs and Gargantuan is increased by 20%."},{"type":"Passive","name":"Pierce the Veil","required-level":27,"icon":"witchdoctor_passive_piercetheveil","description":"All of your damage is increased by 20%, but your Mana costs are increased by 30%."},{"type":"Passive","name":"Spirit Vessel","required-level":30,"icon":"witchdoctor_passive_spiritvessel","description":"Reduces the cooldown of your Horrify, Spirit Walk, and Soul Harvest spells by 2 seconds. In addition, the next time you receive fatal damage, you automatically enter the spirit realm for 2 seconds and heal to 15% of your maximum Life. This effect cannot occur more than once every 90 seconds."},{"type":"Passive","name":"Fetish Sycophants","required-level":30,"icon":"witchdoctor_passive_fetishsycophants","description":"Whenever you cast a physical realm spell, you have a 5% chance to summon a dagger-wielding Fetish to fight by your side for 60 seconds. Physical realm spells are: Poison Dart Plague of Toads Zombie Charger Corpse Spiders Firebats Firebomb Locust Swarm Acid Cloud Wall of Zombies"},{"type":"Passive","name":"Rush of Essence","required-level":36,"icon":"witchdoctor_passive_rushofessence","description":"Spirit spells return 49 Mana over 10 seconds. Spirit spells are: Haunt Horrify Mass Confusion Soul Harvest Spirit Barrage Spirit Walk"},{"type":"Passive","name":"Vision Quest","required-level":40,"icon":"witchdoctor_passive_visionquest","description":"When you deal damage with Corpse Spiders, Firebomb, Plague of Toads or Poison Dart, your Mana regeneration is increased by 30% for 5 seconds."},{"type":"Passive","name":"Fierce Loyalty","required-level":45,"icon":"witchdoctor_passive_fierceloyalty","description":"All your pets get 100% of the benefit of your Thorns and Life regeneration items."},{"type":"Passive","name":"Grave Injustice","required-level":50,"icon":"witchdoctor_passive_graveinjustice","description":"Whenever an enemy dies within 8 yards, regain 2% of your maximum Life and Mana and the cooldown on all of your abilities is reduced by 1 second. This range is extended by items that increase your gold pickup radius."},{"type":"Passive","name":"Tribal Rites","required-level":55,"icon":"witchdoctor_passive_tribalrites","description":"The cooldowns of your Fetish Army, Big Bad Voodoo, Hex, Gargantuan, Summon Zombie Dogs and Mass Confusion abilities are reduced by 25%."}],"screenshots-count":12,"screenshots":["wd-casting-index-thumb","wd-vs-crypt-child-index-thumb","wd-vs-zombies-index-thumb","wd001-index-thumb","wd002-index-thumb","wd003-index-thumb","wd004-index-thumb","wd005-index-thumb","wd006-index-thumb","wd007-index-thumb","wd008-index-thumb","wd009-index-thumb"]},{"name":"Wizard","short-description":"Master of the temporal and elemental energies powering creation itself.","icon_female":"wizard_female","icon_male":"wizard_male","features":[{"name":"Elemental Mastery","icon":"wizard-feature-3","description":"Wizards claim dominion over the natural elements of Sanctuary. Crackling flames, bolts of lightning, blasts of ice and whirlwinds are at their command, and this versatility enables them to target foes' weaknesses and bypass their defenses."},{"name":"Area Attacks","icon":"wizard-feature-1","description":"The battlefield is covered in the forces summoned by a powerful wizard - cones and blasts that hit large groups of creatures at once, rays that punish them for standing close together, and falling rocks that crush those who idle."},{"name":"Protective Spells","icon":"wizard-feature-2","description":"Though not as physically agile or strong as some other heroes, wizards cloak themselves in defensive magics. They can encase their skin in diamonds, create mirror images to befuddle their enemies, and harm or slow those foolish enough to strike at them directly."},{"name":"Endless Energy","icon":"wizard-feature-4","description":"Wizards rarely find themselves without the power of magic. They can nearly always afford to cast their weaker spells thanks to their swiftly-regenerating Arcane Power, and they invoke certain powers more easily as their experience grows."}],"resource":"Unlike more deliberate and cautious magic-users, wizards are lightning rods for Arcane Power. An intense energy courses through them, and they direct it as though it were an extension of their own bodies. Wizards continually crackle with Arcane Power - it regenerates itself quickly, and so they can call upon their lesser abilities seemingly without end. They are only in danger of depleting their stores of energy when attempting a number of invocations at once. However, Arcane Power can ravage wizards' bodies if its use is not carefully paced, so Wizards must endure a cooldown period before repeatedly casting certain potent spells. These spells - conjured meteors falling from the sky, torrents of force that shove multiple foes off their feet, or energy bubbles that halt the flow of time itself - are so powerful that they are worth the wait.","resource-type":"Arcane Power","description":"Wizards are renegade spellcasters who use their bodies as vessels for arcane energy, forsaking the more careful path favored by other magic users. They manipulate all manner of forces to disintegrate, burn, and freeze their foes, and they can control time and light to teleport, create powerful illusions, and deflect oncoming attacks. Wizards grip wands and staves to focus their less potent magics, blasting at their enemies while gathering the energy or time necessary to destroy them in a dazzling hail of arcane might. With few exceptions, wizard attacks are conducted at a distance, away from danger. As living artillery, wizards are well suited to relying on long-range destructive power. ","lore":"Magic-users hail from academies throughout Sanctuary - from Xiansai to Caldeum - bearing monikers like \"sorcerer\" and \"mage,\" but those who would refer to themselves with the derogatory epithet \"wizard\" are as similar to their fellow spellcasters as a lion is to a kitten. Wizards and sorcerers both wield the hidden mysteries of the arcane; there, the commonalities end. Wizards are known for a number of qualities: not only rebelliousness and flair, but also disdain for the endless lessons and prattling about caution and safety that echo from academic schools of magic. Wizards' superior attitudes seem to stem from their natural talent - their ability to wrestle the ambient force of magic into submission and direct it to their ends by will and instinct. Any accidents that might occur due to their lack of finesse are unfortunate...but that rarely stops wizards from indulging in their unstable power. If they can only master their double-edged gift and avoid destroying themselves, these upstart arcane prodigies may be able to finally reach the destiny that they see on the horizon.","equipment":"Though all material items serve as channels for the wizard's immense power, some have particularly special uses. Wizards wield orbs, which aren't quite weapons - instead, they're off-handed supplements that provide them with visions and knowledge to aid their spellcasting, or serve as reservoirs of power. Wizards also equip themselves with traditional (and often enchanted) wands, thin sticks that they use to direct monumental arcane forces at their targets.","tier-1":"Early wizard armor is quilted wear that would have been out of place in a Caldeum academy, and is equally out of place protecting young wizards from arrows and claws.","tier-2":"Some effort and battlefield experience can rectify the situation, as later armor sets integrate hardened chestplates and greaves with travel tunics and trailing robes.","tier-3":"Truly successful wizards wear the rewards of their questing proudly: flowing capes ornamented in the Xiansai style and crowned headpieces, all carefully placed amidst embossed metal that a soldier would envy.","active-skills":[{"name":"Magic Missile","required-level":1,"icon":"wizard_magicmissile","type":"Primary","signature-spell":true,"description":"Launch a missile of magic energy, causing 125% weapon damage as Arcane.","runes":[{"required-level":6,"name":"Charged Blast","description":"Increases the damage of Magic Missile to 163% weapon damage as Arcane.","icon":"rune_a"},{"required-level":13,"name":"Split","description":"Fire 3 missiles that each deal 56% weapon damage as Arcane.","icon":"rune_b"},{"required-level":31,"name":"Penetrating Blast","description":"Missiles have a 100% chance to pierce through their target and hit additional enemies.","icon":"rune_c"},{"required-level":42,"name":"Attunement","description":"Whenever Magic Missile hits a target you gain 4 Arcane Power.","icon":"rune_d"},{"required-level":52,"name":"Seeker","description":"Missiles track the nearest enemy and their damage is increased to 138% weapon damage as Arcane.","icon":"rune_e"}]},{"name":"Ray of Frost","required-level":2,"icon":"wizard_rayoffrost","type":"Secondary","description":"Cost: 16 Arcane Power Project a beam of frozen ice that blasts 215% weapon damage as Cold to the first enemy it hits, slowing the target's movement by 60% for 4 seconds.","runes":[{"required-level":7,"name":"Numb","description":"Increase the amount the target's movement is slowed to 80% for 4 seconds.","icon":"rune_c"},{"required-level":15,"name":"Snow Blast","description":"Using continuously on a single target increases damage over 1.5 seconds to inflict a maximum of 280% weapon damage as Cold.","icon":"rune_a"},{"required-level":28,"name":"Cold Blood","description":"Reduce casting cost to 10 Arcane Power.","icon":"rune_d"},{"required-level":38,"name":"Sleet Storm","description":"Create a swirling storm around you, dealing 280% weapon damage as Cold to all enemies caught within it.","icon":"rune_b"},{"required-level":53,"name":"Black Ice","description":"Enemies killed with Ray of Frost leave behind a patch of ice that deals 387% weapon damage as Cold to enemies moving through it over 3 seconds.","icon":"rune_e"}]},{"name":"Shock Pulse","required-level":3,"icon":"wizard_shockpulse","type":"Primary","signature-spell":true,"description":"Release a medium range pulse of 3 unpredictable charges of electricity that deal 105% weapon damage as Lightning.","runes":[{"required-level":9,"name":"Explosive Bolts","description":"Slain enemies explode, dealing 70% weapon damage as Lightning to every enemy within 10 yards.","icon":"rune_e"},{"required-level":18,"name":"Fire Bolts","description":"Cast bolts of fire that each deal 152% weapon damage as Fire.","icon":"rune_a"},{"required-level":33,"name":"Piercing Orb","description":"Merge the bolts in a single giant orb that oscillates forward dealing 105% weapon damage as Lightning to everything it hits.","icon":"rune_c"},{"required-level":47,"name":"Lightning Affinity","description":"Every target hit by a pulse restores 3 Arcane Power.","icon":"rune_d"},{"required-level":54,"name":"Living Lightning","description":"Conjure a being of lightning that drifts forward, electrocuting nearby enemies for 37% weapon damage as Lightning.","icon":"rune_b"}]},{"name":"Frost Nova","required-level":4,"icon":"wizard_frostnova","type":"Defensive","cooldown":12,"cooldown-units":"seconds","cooldown-description":"","description":"Blast nearby enemies with an explosion of ice and freeze them for 3 seconds.","runes":[{"required-level":12,"name":"Shatter","description":"A frozen enemy that is killed has a 50% chance of releasing another Frost Nova.","icon":"rune_b"},{"required-level":18,"name":"Cold Snap","description":"Reduce cooldown of Frost Nova to 9 seconds.","icon":"rune_d"},{"required-level":28,"name":"Frozen Mist","description":"Frost Nova no longer freezes enemies, but instead leaves behind a mist of frost that deals 160% weapon damage as Cold over 8 seconds.","icon":"rune_c"},{"required-level":41,"name":"Deep Freeze","description":"If Frost Nova hits at least 5 targets, you gain a 15% bonus to Critical Hit Chance for 12 seconds.","icon":"rune_e"},{"required-level":51,"name":"Bone Chill","description":"Enemies take 15% more damage while frozen or chilled by Frost Nova.","icon":"rune_a"}]},{"name":"Arcane Orb","required-level":5,"icon":"wizard_arcaneorb","type":"Secondary","description":"Cost: 35 Arcane Power Hurl an orb of pure energy that explodes when it hits, dealing 175% weapon damage as Arcane to all enemies within 10 yards.","runes":[{"required-level":11,"name":"Obliteration","description":"Increase the damage of the explosion to deal 228% weapon damage as Arcane.","icon":"rune_a"},{"required-level":20,"name":"Arcane Orbit","description":"Create 4 Arcane Orbs that orbit you, exploding for 70% weapon damage as Arcane when enemies get close.","icon":"rune_c"},{"required-level":32,"name":"Arcane Nova","description":"Modify the orb to deal 175% weapon damage as Arcane to all enemies within 20 yards.","icon":"rune_b"},{"required-level":45,"name":"Tap the Source","description":"Reduce casting cost to 20 Arcane Power.","icon":"rune_d"},{"required-level":55,"name":"Celestial Orb","description":"The orb will pierce through targets, damaging any enemy it passes through.","icon":"rune_e"}]},{"name":"Diamond Skin","required-level":8,"icon":"wizard_diamondskin","type":"Defensive","cooldown":15,"cooldown-units":"seconds","cooldown-description":"","description":"Transform your skin to diamond for 6 seconds, absorbing up to 10853 damage from incoming attacks.","runes":[{"required-level":14,"name":"Crystal Shell","description":"Increases the maximum amount of damage absorbed to 21707 damage.","icon":"rune_c"},{"required-level":20,"name":"Prism","description":"Reduces Arcane Power cost of all spells by 7 while Diamond Skin is active.","icon":"rune_d"},{"required-level":32,"name":"Mirror Skin","description":"Reflects 100% of damage absorbed back at the attacker.","icon":"rune_a"},{"required-level":44,"name":"Enduring Skin","description":"Increases the duration of Diamond Skin to 9 seconds.","icon":"rune_b"},{"required-level":56,"name":"Diamond Shards","description":"When Diamond Skin wears off, diamond shards explode in all directions dealing 210% weapon damage as Physical to nearby enemies.","icon":"rune_e"}]},{"name":"Wave of Force","required-level":9,"icon":"wizard_waveofforce","type":"Force","cooldown":12,"cooldown-units":"seconds","cooldown-description":"","description":"Discharge a wave of pure energy that repels projectiles and knocks back nearby enemies. This also slows the movement of enemies by 60% and deals 200% weapon damage as Physical.","runes":[{"required-level":15,"name":"Impactful Wave","description":"Increases the distance enemies are knocked back and Stuns all affected enemies for 2 seconds.","icon":"rune_e"},{"required-level":22,"name":"Force Affinity","description":"Reduce casting cost to 15 Arcane Power and the cooldown is reduced to 9 seconds.","icon":"rune_d"},{"required-level":32,"name":"Forceful Wave","description":"Increases damage to 260% weapon damage as Physical, but reduces Knockback.","icon":"rune_a"},{"required-level":39,"name":"Teleporting Wave","description":"Enemies caught in the wave are teleported to a random location.","icon":"rune_c"},{"required-level":49,"name":"Exploding Wave","description":"Enemies hit have a 40% chance to cause a smaller Wave of Force that deals 100% weapon damage as Physical and knocks back enemies caught in its wake.","icon":"rune_b"}]},{"name":"Spectral Blade","required-level":11,"icon":"wizard_spectralblade","type":"Primary","signature-spell":true,"description":"Summon a spectral blade that strikes all enemies in your path for 165% weapon damage.","runes":[{"required-level":19,"name":"Deep Cuts","description":"Enemies hit by the blade will Bleed for an additional 45% weapon damage over 3 seconds.","icon":"rune_a"},{"required-level":24,"name":"Impactful Blades","description":"Hits Slow the movement of enemies by 80% for 1 second.","icon":"rune_c"},{"required-level":35,"name":"Siphoning Blade","description":"Every enemy hit grants 3 Arcane Power.","icon":"rune_d"},{"required-level":51,"name":"Healing Blades","description":"Whenever the blades do damage, you are healed for 5% of the damage done.","icon":"rune_e"},{"required-level":57,"name":"Thrown Blade","description":"Extends the reach of Spectral Blade to 20 yards.","icon":"rune_b"}]},{"name":"Arcane Torrent","required-level":12,"icon":"wizard_arcanetorrent","type":"Secondary","description":"Cost: 16 Arcane Power Hurl a barrage of arcane projectiles that deal 210% weapon damage as Arcane to all enemies near the impact location.","runes":[{"required-level":18,"name":"Disruption","description":"Targets hit by Arcane Torrent become disrupted for 6 seconds, causing them to take 15% additional damage from any attacks that deal Arcane damage.","icon":"rune_a"},{"required-level":25,"name":"Death Blossom","description":"Unleash a torrent of power beyond your control. You no longer direct where the projectiles go, but their damage is increased to 670% weapon damage as Arcane.","icon":"rune_e"},{"required-level":34,"name":"Arcane Mines","description":"Instead of firing projectiles, lay Arcane mines that arm after 2 seconds. These mines explode when an enemy approaches, dealing 180% weapon damage as Arcane. Enemies caught in the explosion have their movement and attack speeds reduced by 30% for 3 seconds.","icon":"rune_c"},{"required-level":49,"name":"Power Stone","description":"Every missile hit has a 2% chance to leave behind a Power Stone that grants Arcane Power when picked up.","icon":"rune_d"},{"required-level":57,"name":"Cascade","description":"Enemies killed by Arcane Torrent have a 100% chance to fire a new missile at a nearby enemy dealing 210% weapon damage as Arcane.","icon":"rune_b"}]},{"name":"Energy Twister","required-level":13,"icon":"wizard_energytwister","type":"Force","description":"Cost: 35 Arcane Power Unleash a twister of pure energy that deals 360% weapon damage as Arcane over 6 seconds to everything in its path.","runes":[{"required-level":19,"name":"Mistral Breeze","description":"Reduces casting cost of Energy Twister to 20 Arcane Power.","icon":"rune_d"},{"required-level":24,"name":"Gale Force","description":"Increases the damage of Energy Twister to 468% weapon damage as Arcane.","icon":"rune_a"},{"required-level":36,"name":"Raging Storm","description":"When two Energy Twisters collide, they merge into a tornado with increased area of effect that causes 360% weapon damage as Arcane over 6 seconds.","icon":"rune_b"},{"required-level":41,"name":"Wicked Wind","description":"Twisters no longer travel but spin in place, dealing 252% weapon damage as Arcane over 6 seconds to everything caught in them.","icon":"rune_e"},{"required-level":52,"name":"Storm Chaser","description":"Casting Energy Twister grants you a Wind Charge. You can store up to 3 Wind Charges at a time. Casting a Signature spell releases all Wind Charges as a giant Energy Twister that deals 75% weapon damage as Arcane per Wind Charge.The following skills are Signature spells: Magic Missile Shock Pulse Spectral Blade Electrocute","icon":"rune_c"}]},{"name":"Ice Armor","required-level":14,"icon":"wizard_icearmor","type":"Conjuration","description":"Cost: 25 Arcane Power Surround yourself in a barrier of ice that reduces damage from melee attacks by 12%. Melee attackers are either Chilled or Frozen for 2 seconds. Lasts 120 seconds. This is an Armor spell. Only one Armor spell can be active at a time.","runes":[{"required-level":21,"name":"Chilling Aura","description":"Lower the temperature of the air around you. Nearby enemies are chilled, slowing their movement speed by 30%.","icon":"rune_b"},{"required-level":31,"name":"Crystallize","description":"Whenever you are struck by a melee attack, your Armor is increased by 20% for 30 seconds. This effect can stack up to 3 times.","icon":"rune_d"},{"required-level":42,"name":"Jagged Ice","description":"Melee attackers also take 130% weapon damage as Cold.","icon":"rune_a"},{"required-level":49,"name":"Ice Reflect","description":"Melee attacks have a 25% chance to create a Frost Nova centered on the attacker, dealing 75% weapon damage as Cold.","icon":"rune_e"},{"required-level":53,"name":"Frozen Storm","description":"A whirling storm of ice builds around you that deals 30% weapon damage as Cold over 3 seconds after casting Ice Armor.","icon":"rune_c"}]},{"name":"Electrocute","required-level":15,"icon":"wizard_electrocute","type":"Primary","signature-spell":true,"description":"Lightning arcs from your fingertips, dealing 90% weapon damage as Lightning. The lightning can jump, hitting up to 2 additional enemies.","runes":[{"required-level":22,"name":"Chain Lightning","description":"Increases the maximum number of enemies that can be electrocuted to 6.","icon":"rune_b"},{"required-level":29,"name":"Forked Lightning","description":"Critical Hits release 4 charged bolts in random directions, dealing 55% weapon damage as Lightning to any targets hit.","icon":"rune_e"},{"required-level":36,"name":"Lightning Blast","description":"Create streaks of lightning that pierce through targets, hitting all enemies for 86% weapon damage as Lightning.","icon":"rune_a"},{"required-level":44,"name":"Surge of Power","description":"Gain 1 Arcane Power for every enemy hit by Electrocute.","icon":"rune_d"},{"required-level":59,"name":"Arc Lightning","description":"Blast a cone of lightning that causes 115% weapon damage as Lightning to all affected targets.","icon":"rune_c"}]},{"name":"Slow Time","required-level":16,"icon":"wizard_slowtime","type":"Defensive","cooldown":15,"cooldown-units":"seconds","cooldown-description":"","description":"Invoke a bubble of warped time and space for 8 seconds, reducing enemy attack speed by 20% and movement speed by 60%. This bubble also slows the movement of enemy projectiles by 90%.","runes":[{"required-level":23,"name":"Miasma","description":"Slow Time effects cling to enemies for 3 seconds after they have left the bubble.","icon":"rune_b"},{"required-level":29,"name":"Time Warp","description":"Enemies caught in the bubble of warped time take 20% more damage.","icon":"rune_a"},{"required-level":39,"name":"Time Shell","description":"Increases the potency of the movement speed reduction to 80%.","icon":"rune_c"},{"required-level":47,"name":"Perpetuity","description":"Reduces the cooldown of Slow Time to 12 seconds.","icon":"rune_d"},{"required-level":53,"name":"Stretch Time","description":"Time is sped up for any allies standing in the area, increasing their attack speed by 10%.","icon":"rune_e"}]},{"name":"Storm Armor","required-level":17,"icon":"wizard_stormarmor","type":"Conjuration","description":"Cost: 25 Arcane Power Bathe yourself in electrical energy, periodically shocking a nearby enemy for 100% weapon damage as Lightning. Lasts 120 seconds. This is an Armor spell. Only one Armor spell can be active at a time.","runes":[{"required-level":23,"name":"Reactive Armor","description":"Ranged and melee attackers are shocked for 70% weapon damage as Lightning.","icon":"rune_c"},{"required-level":33,"name":"Power of the Storm","description":"Reduce the Arcane Power cost of all skills by 3 while Storm Armor is active.","icon":"rune_d"},{"required-level":37,"name":"Thunder Storm","description":"Increase the damage of the shock to 130% weapon damage as Lightning.","icon":"rune_a"},{"required-level":43,"name":"Scramble","description":"Increases your movement speed by 25% for 3 seconds whenever you are hit by melee or ranged attacks.","icon":"rune_b"},{"required-level":58,"name":"Shocking Aspect","description":"Critical Hits have a chance to electrocute a nearby enemy for 35% weapon damage as Lightning.","icon":"rune_e"}]},{"name":"Explosive Blast","required-level":19,"icon":"wizard_explosiveblast","type":"Mastery","cooldown":6,"cooldown-units":"seconds","cooldown-description":"","description":"Gather an infusion of energy around you that explodes after 1.5 seconds, causing 225% weapon damage as Physical to all enemies within 12 yards.","runes":[{"required-level":24,"name":"Unleashed","description":"Reduces the casting cost of Explosive Blast to 10 Arcane Power.","icon":"rune_d"},{"required-level":29,"name":"Time Bomb","description":"Explosive Blast detonates from the point it was originally cast after 2.5 seconds for 315% weapon damage as Physical.","icon":"rune_c"},{"required-level":39,"name":"Short Fuse","description":"Immediately release the energy of Explosive Blast for 225% weapon damage as Physical.","icon":"rune_a"},{"required-level":50,"name":"Obliterate","description":"Increases the explosion radius to 18 yards for 225% weapon damage as Physical.","icon":"rune_b"},{"required-level":56,"name":"Chain Reaction","description":"A chain of 3 consecutive explosions cascade off you, each causing 97% weapon damage as Physical.","icon":"rune_e"}]},{"name":"Magic Weapon","required-level":20,"icon":"wizard_magicweapon","type":"Conjuration","description":"Cost: 25 Arcane Power Imbue your weapon with magical energy, granting it 10% increased damage. Lasts 5 minutes.","runes":[{"required-level":27,"name":"Electrify","description":"Attacks have a chance to cause lightning to arc to 3 nearby enemies, dealing 10% weapon damage as Lightning.","icon":"rune_b"},{"required-level":35,"name":"Force Weapon","description":"Increases the damage bonus of Magic Weapon to 15% damage, and gives up to a 2% chance to Knockback any enemies hit.","icon":"rune_c"},{"required-level":38,"name":"Conduit","description":"Attacks have a chance to restore 1 Arcane Power.","icon":"rune_d"},{"required-level":46,"name":"Venom","description":"Attacks poison enemies, dealing 15% weapon damage as Poison over 3 seconds.","icon":"rune_a"},{"required-level":55,"name":"Blood Magic","description":"Attacks recover 1.5% of damage caused as Life.","icon":"rune_e"}]},{"name":"Hydra","required-level":21,"icon":"wizard_hydra","type":"Force","description":"Cost: 15 Arcane Power Summon a multi-headed Hydra for 15 seconds that attacks enemies with bolts of fire dealing 28% weapon damage as Fire. You may only have one Hydra active at a time.","runes":[{"required-level":26,"name":"Arcane Hydra","description":"Summon an Arcane Hydra that spits Arcane Orbs, which explode on impact, causing 60% weapon damage as Arcane to enemies near the explosion.","icon":"rune_e"},{"required-level":33,"name":"Lightning Hydra","description":"Summon a Lightning Hydra that electrocutes enemies for 64% weapon damage as Lightning.","icon":"rune_b"},{"required-level":38,"name":"Venom Hydra","description":"Summon a poison breathing Hydra that leaves a pool of acid that causes 18% weapon damage per second as Poison to enemies who remain in the pool.","icon":"rune_c"},{"required-level":46,"name":"Frost Hydra","description":"Summon a Frost Hydra that breathes a short range cone of frost, causing 36% weapon damage as Cold to all enemies in the cone.","icon":"rune_a"},{"required-level":56,"name":"Mammoth Hydra","description":"Summon a Mammoth Hydra that breathes a river of flame at nearby enemies, dealing 67% weapon damage per second as Fire to enemies caught on the burning ground.","icon":"rune_d"}]},{"name":"Disintegrate","required-level":21,"icon":"wizard_disintegrate","type":"Secondary","description":"Cost: 18 Arcane Power Thrust a beam of pure energy forward, dealing 170% weapon damage as Arcane and disintegrating enemies it kills.","runes":[{"required-level":26,"name":"Convergence","description":"Increase the width of the beam allowing it to hit more enemies.","icon":"rune_b"},{"required-level":30,"name":"Chaos Nexus","description":"When casting the beam you become charged with energy that spits out at nearby enemies doing 44% weapon damage as Arcane.","icon":"rune_d"},{"required-level":39,"name":"Volatility","description":"Enemies killed by the beam have a 35% chance to explode causing 395% weapon damage as Arcane to all enemies within 8 yards.","icon":"rune_e"},{"required-level":48,"name":"Entropy","description":"The beam fractures into a short-ranged cone that deals 196% weapon damage as Arcane.","icon":"rune_c"},{"required-level":59,"name":"Intensify","description":"Damage increases slowly over time to inflict a maximum of 221% weapon damage as Arcane.","icon":"rune_a"}]},{"name":"Familiar","required-level":22,"icon":"wizard_familiar","type":"Conjuration","description":"Cost: 20 Arcane Power Summon a companion that will attack your targets for 20% weapon damage as Arcane. This companion cannot be targeted or damaged by enemies and lasts for 5 minutes.","runes":[{"required-level":30,"name":"Sparkflint","description":"Summon a fiery Familiar that increases the damage of all attacks by 12% while Familiar is active.","icon":"rune_a"},{"required-level":40,"name":"Vigoron","description":"While the Familiar is active, you regenerate 310 Life per second.","icon":"rune_c"},{"required-level":44,"name":"Ancient Guardian","description":"Summon a protective Familiar. When you are below 50% Life the Familiar will fully absorb damage from 1 attack every 6 seconds.","icon":"rune_e"},{"required-level":50,"name":"Arcanot","description":"While the Familiar is active, you regenerate 2 Arcane Power per second.","icon":"rune_d"},{"required-level":57,"name":"Cannoneer","description":"The Familiar's projectiles explode on impact, dealing 20% weapon damage as Arcane to all enemies within 6 yards.","icon":"rune_b"}]},{"name":"Teleport","required-level":22,"icon":"wizard_teleport","type":"Defensive","cooldown":16,"cooldown-units":"seconds","cooldown-description":"","description":"Teleport through the ether to the selected location up to 35 yards away.","runes":[{"required-level":26,"name":"Safe Passage","description":"For 4 seconds after you Teleport, you will take 30% less damage.","icon":"rune_c"},{"required-level":31,"name":"Wormhole","description":"After casting Teleport, there is a 1 second delay before the cooldown begins, allowing you to Teleport again.","icon":"rune_e"},{"required-level":37,"name":"Reversal","description":"Casting Teleport again within 8 seconds will instantly return you to your original location.","icon":"rune_d"},{"required-level":43,"name":"Fracture","description":"Summon 2 decoys for 8 seconds after teleporting.","icon":"rune_b"},{"required-level":59,"name":"Calamity","description":"Casts a low power Wave of Force upon arrival, dealing 265% weapon damage as Physical to all nearby enemies.","icon":"rune_a"}]},{"name":"Mirror Image","required-level":25,"icon":"wizard_mirrorimage","type":"Mastery","cooldown":15,"cooldown-units":"seconds","cooldown-description":"","description":"Summon 2 illusionary duplicates of yourself that last for 7 seconds and have 25% of your Life. The images may cast some of the same spells as you, but those spells deal no damage.","runes":[{"required-level":31,"name":"Simulacrum","description":"Increase the Life of your Mirror Images to 100% of your own.","icon":"rune_c"},{"required-level":37,"name":"Duplicates","description":"Summon 5 Mirror Images that have 25% of your Life each.","icon":"rune_b"},{"required-level":45,"name":"Mocking Demise","description":"When a Mirror Image is destroyed, it explodes, doing 45% weapon damage as Physical and has a 50% chance to Stun for 2 seconds.","icon":"rune_e"},{"required-level":51,"name":"Extension of Will","description":"The duration of your Mirror Images is increased to 10 seconds and their Life is increased to 29% of your Life.","icon":"rune_d"},{"required-level":58,"name":"Mirror Mimics","description":"Spells cast by your Mirror Images will do 10% of the damage of your own spells.","icon":"rune_a"}]},{"name":"Meteor","required-level":25,"icon":"wizard_meteor","type":"Force","description":"Cost: 50 Arcane Power Summon an immense Meteor that plummets from the sky, causing 260% weapon damage as Fire to all enemies it crashes into. The ground it hits is scorched with molten fire that deals 60% weapon damage as Fire over 3 seconds.","runes":[{"required-level":29,"name":"Molten Impact","description":"Increases the damage of the Meteor impact to 390% weapon damage as Fire and the molten fire to 90% weapon damage as Fire over 3 seconds.","icon":"rune_a"},{"required-level":34,"name":"Star Pact","description":"Reduces the casting cost of Meteor to 35 Arcane Power and the damage type to Arcane.","icon":"rune_d"},{"required-level":43,"name":"Meteor Shower","description":"Unleash a volley of 7 smaller Meteors that each strike for 104% weapon damage as Fire.","icon":"rune_b"},{"required-level":48,"name":"Comet","description":"Transforms the Meteor to ice that deals 312% weapon damage as Cold. The impact site is covered in a freezing mist that deals 72% weapon damage as Cold and Slows enemy movement by 60% over 3 seconds.","icon":"rune_c"},{"required-level":58,"name":"Liquefy","description":"If the initial impact of the Meteor causes a Critical Hit, the molten fire duration is increased to 8 seconds.","icon":"rune_e"}]},{"name":"Blizzard","required-level":27,"icon":"wizard_blizzard","type":"Force","description":"Cost: 40 Arcane Power Call down shards of ice to pelt an area, dealing 210% weapon damage as Cold to all enemies in the area over 6 seconds. Multiple casts in the same area do not stack.","runes":[{"required-level":35,"name":"Grasping Chill","description":"After the Blizzard ends, the ground is covered in a low lying mist for 3 seconds that Slows the movement speed of enemies by 60%.","icon":"rune_c"},{"required-level":42,"name":"Frozen Solid","description":"Enemies caught in the Blizzard have a 20% chance to be Frozen for 3 seconds.","icon":"rune_e"},{"required-level":47,"name":"Snowbound","description":"Reduces the casting cost of Blizzard to 20 Arcane Power.","icon":"rune_d"},{"required-level":54,"name":"Stark Winter","description":"Increases the size of Blizzard to cover 22 yards, dealing 210% weapon damage as Cold over 6 seconds.","icon":"rune_b"},{"required-level":60,"name":"Unrelenting Storm","description":"Increases the duration of Blizzard to deal 280% weapon damage as Cold over 8 seconds.","icon":"rune_a"}]},{"name":"Energy Armor","required-level":28,"icon":"wizard_energyarmor","type":"Conjuration","description":"Cost: 25 Arcane Power Focus your energies, increasing your Armor by 35% but decreasing your maximum Arcane Power by 20. Lasts 120 seconds. This is an Armor spell. Only one Armor spell can be active at a time.","runes":[{"required-level":32,"name":"Absorption","description":"You have a chance to gain 4 Arcane Power whenever you are hit by a ranged or melee attack.","icon":"rune_d"},{"required-level":41,"name":"Pinpoint Barrier","description":"Increases your chance to critically hit by 5% while Energy Armor is active.","icon":"rune_e"},{"required-level":48,"name":"Energy Tap","description":"Rather than decreasing your maximum Arcane Power, Energy Armor increases it by 20 while it is active.","icon":"rune_b"},{"required-level":54,"name":"Force Armor","description":"While Energy Armor is active, incoming attacks that would deal more than 35% of your maximum Life are reduced to deal 35% of your maximum Life instead.","icon":"rune_c"},{"required-level":60,"name":"Prismatic Armor","description":"Increases all of your resistances by 25% while Energy Armor is active.","icon":"rune_a"}]},{"name":"Archon","required-level":30,"icon":"wizard_archon","type":"Mastery","cooldown":120,"cooldown-units":"seconds","cooldown-description":"","description":"Transform into a being of pure Arcane energy for 15 seconds. While in Archon form, your normal abilities are replaced by powerful Archon abilities, and your Armor and resistances are increased by 40%. Every enemy killed while in Archon form adds 1 seconds to the duration of Archon.","runes":[{"required-level":36,"name":"Arcane Destruction","description":"An explosion erupts around you when you transform, causing 1600% weapon damage as Arcane to all enemies within 15 yards.","icon":"rune_e"},{"required-level":40,"name":"Teleport","description":"Archon form can now cast Teleport with a cooldown of 10 seconds.","icon":"rune_c"},{"required-level":46,"name":"Pure Power","description":"Decreases the cooldown of Archon to 100 seconds.","icon":"rune_d"},{"required-level":52,"name":"Slow Time","description":"Archon form can cast Slow Time that lasts for 15 seconds.","icon":"rune_b"},{"required-level":60,"name":"Improved Archon","description":"Increases the damage of all Archon abilities by 25%.","icon":"rune_a"}]}],"passive-skills":[{"type":"Passive","name":"Power Hungry","required-level":10,"icon":"wizard_passive_powerhungry","description":"Gain 30 Arcane Power whenever you are healed by a health globe."},{"type":"Passive","name":"Blur","required-level":10,"icon":"wizard_passive_blur","description":"Decreases melee damage taken by 20%."},{"type":"Passive","name":"Evocation","required-level":13,"icon":"wizard_passive_evocation","description":"Reduces all cooldowns by 15%."},{"type":"Passive","name":"Glass Cannon","required-level":16,"icon":"wizard_passive_glasscannon","description":"Increases all damage done by 15%, but decreases Armor and resistances by 10%."},{"type":"Passive","name":"Prodigy","required-level":20,"icon":"wizard_passive_prodigy","description":"When you deal damage with a Signature spell, you gain 4 Arcane Power. The following skills are Signature spells: Magic Missile Shock Pulse Spectral Blade Electrocute"},{"type":"Passive","name":"Astral Presence","required-level":24,"icon":"wizard_passive_astralpresence","description":"Increases your maximum Arcane Power by 20 and Arcane Power regeneration by 2 per second."},{"type":"Passive","name":"Illusionist","required-level":27,"icon":"wizard_passive_illusionist","description":"Whenever you suffer more than 15% of your Life in a single hit, the cooldowns on Mirror Image and Teleport are automatically reset."},{"type":"Passive","name":"Cold Blooded","required-level":30,"icon":"wizard_passive_coldblooded","description":"All damage dealt to chilled and frozen targets is increased by 20%."},{"type":"Passive","name":"Conflagration","required-level":34,"icon":"wizard_passive_conflagration","description":"Fire damage dealt to enemies applies a burning effect, increasing all damage done to them by 10% for 3 seconds."},{"type":"Passive","name":"Paralysis","required-level":37,"icon":"wizard_passive_paralysis","description":"Lightning damage dealt to enemies has up to a 8% chance to Stun the target for 1.5 seconds."},{"type":"Passive","name":"Galvanizing Ward","required-level":40,"icon":"wizard_passive_galvanizingward","description":"Increases the duration of your Armor spells by 120 seconds. As long as an Armor spell is active, you gain 310 Life per second. The following skills are improved: Energy Armor Ice Armor Storm Armor"},{"type":"Passive","name":"Temporal Flux","required-level":45,"icon":"wizard_passive_temporalflux","description":"Whenever you deal Arcane damage, enemies are slowed by 30% for 2 seconds."},{"type":"Passive","name":"Critical Mass","required-level":50,"icon":"wizard_passive_criticalmass","description":"Critical Hits have a chance to reduce the cooldown of your spells by 1 second."},{"type":"Passive","name":"Arcane Dynamo","required-level":55,"icon":"wizard_passive_arcanedynamo","description":"When you deal damage with a Signature spell you may gain a Flash of Insight. After 5 Flashes of Insight, your next non-Signature spell deals 75% additional damage. The following skills are Signature spells: Magic Missile Shock Pulse Spectral Blade Electrocute"},{"type":"Passive","name":"Unstable Anomaly","required-level":60,"icon":"wizard_passive_unstableanomaly","description":"When reduced below 30% Life, you heal to 45% of your maximum Life and release a shockwave that knocks enemies back and slows them by 60% for 3 seconds. This effect cannot occur more than once every 60 seconds."}],"screenshots-count":12,"screenshots":["wizard-about-to-descend-index-thumb","wizard-and-templar-meet-a-stranger-index-thumb","wizard-casting-arcane-orb-index-thumb","wizard-casting-electrocute-index-thumb","wizard-casting-frost-nova-index-thumb","wizard-casting-hydra-index-thumb","wizard-charging-in-index-thumb","wizard-is-rewarded-index-thumb","wizard-unleashes-disintegrate-index-thumb","wizard-vs-skeleton-king-index-thumb","wizard-vs-skeleton-king2-index-thumb","wizard-vs-skeleton-summoner-index-thumb"]}],"class-attributes":[{"name":"Barbarian","skill-types":["Primary","Secondary","Defensive","Might","Tactics","Rage"]},{"name":"Demon Hunter","skill-types":["Primary","Secondary","Defensive","Hunting","Devices","Archery"]},{"name":"Monk","skill-types":["Primary","Secondary","Defensive","Techniques","Focus","Mantras"]},{"name":"Witch Doctor","skill-types":["Primary","Secondary","Defensive","Terror","Decay","Voodoo"]},{"name":"Wizard","skill-types":["Primary","Secondary","Defensive","Force","Conjuration","Mastery"]}],"followers":[{"name":"Templar","short-description":"Peerless holy warrior who challenges demons head-on in melee.","features":[{"name":"Defensive Fighting","icon":"templar-feature-2","description":"By taunting enemies, Kormac can make himself the focus of their aggression, and punish them for it, crippling or slowing those that draw too close."},{"name":"Healing & Recovery","icon":"templar-feature-1","description":"Kormac calls on his faith to rejuvenate your health or empower you, increasing your natural rate of healing or resource regeneration."},{"name":"Holy Justice","icon":"templar-feature-3","description":"Despite his defensive posture, Kormac is equally capable of purging demonic filth with violence. When charging, he causes wicked wounds and leaves foes stunned with the ferocity of his attacks."}],"description":"The templar are holy warriors, fighting for justice and eschewing the dangers that lead to cultism and demonic possession by espousing self-denial. They do not merely pay lip service to protecting the realm - they are battle-trained and experienced to a man, and the brooding, dedicated Kormac is a paragon among them. Kormac came to the order as a young man, and was quickly molded into the ideal templar, adapting naturally to an ascetic way of life. His devotion is particularly unshakable, even for one of his order, and, despite his respect for battle prowess, his disdain for those who don't share his high moral standards is readily apparent. Though Kormac's ways will not always be your own, your aims and goals align, and so he will fight alongside you to purge the world of the insidious darkness that would hide from the light of Heaven. ","skills":[{"name":"Heal","required-level":"5","description":"Heals you and the Templar for 4651 Life. ","cooldown":"30","cooldown-units":"seconds","cooldown-description":""},{"name":"Intervene","required-level":"5","description":"Taunt enemies within 10 yards of you for 1 second when you are hit. ","cooldown":"30","cooldown-units":"seconds","cooldown-description":""},{"name":"Loyalty","required-level":"10","description":"Regenerates 155 Life per second for you and the Templar. "},{"name":"Intimidate","required-level":"10","description":"Enemies that hit or are hit by the Templar are slowed by 60% for 3 seconds. "},{"name":"Charge","required-level":"15","description":"Charges a target, dealing 50% weapon damage and stunning all enemies within 8 yards for 2 seconds. ","cooldown":"30","cooldown-units":"seconds","cooldown-description":""},{"name":"Onslaught","required-level":"15","description":"Delivers a massive blow to an enemy for 200% weapon damage. ","cooldown":"15","cooldown-units":"seconds","cooldown-description":""},{"name":"Inspire","required-level":"20","description":"Increases your resource generation. Mana: 4 per second.Arcane Power: 0.5 per second.Hatred: 1 per second.Fury: 8% generated.Spirit: 12% generated. "},{"name":"Guardian","required-level":"20","description":"Rush to your aid, knocking back enemies within 15 yards and healing you for 4651 Life. ","cooldown":"30","cooldown-units":"seconds","cooldown-description":""}]},{"name":"Scoundrel","short-description":"Expert grifter who poisons, blinds, and skewers enemies from range.","features":[{"name":"Ranged Killing","icon":"scoundrel-feature-3","description":"Thanks to Lyndon's proficiency with ranged weapons, he can fire multiple bolts at once, poison his arrows for persistent damage, or decimate the armies of the Burning Hells with explosive shots."},{"name":"Disabling Shots","icon":"scoundrel-feature-2","description":"With carefully placed shots and tricks, Lyndon can cripple or blind your enemies, or evade imminent danger to himself."},{"name":"Attack Boosts","icon":"scoundrel-feature-1","description":"Lyndon's cunning extends to finding the best way to deliver quick or devastating hits, and he shares this knowledge with his allies."}],"description":"Where strife festers, opportunists are rarely far behind. A land caught between the High Heavens and the Burning Hells overflows with rogues and rakes, and both of those words certainly describe Lyndon. The recent years of his whirlwind existence have been spent running from place to place, conning locals, seducing ladies, and relieving the unwitting of their drink and money. The threat of imprisonment or an armed guard has never dissuaded Lyndon from living a life of larceny. Dedicating himself to a conflict against an endless stream of cruel demons and rampaging beasts seems out of character for a man so outwardly charming and unhesitatingly selfish. There must be more to Lyndon than his lust for wine, women and wealth. Mustn't there? ","skills":[{"name":"Crippling Shot","required-level":"5","description":"Ranged attack that slows the target by 60% for 3 seconds. ","cooldown":"6","cooldown-units":"seconds","cooldown-description":""},{"name":"Poison Bolts","required-level":"5","description":"Ranged attack which deals 100% weapon damage and an additional 40% weapon damage as Poison over 2 seconds. ","cooldown":"6","cooldown-units":"seconds","cooldown-description":""},{"name":"Dirty Fighting","required-level":"10","description":"Blinds enemies in front of the Scoundrel for 3 seconds. ","cooldown":"30","cooldown-units":"seconds","cooldown-description":""},{"name":"Vanish","required-level":"10","description":"The Scoundrel vanishes in a cloud of smoke when injured, reappearing after 5 seconds. While vanished, he will heal himself for 15505 Life. ","cooldown":"30","cooldown-units":"seconds","cooldown-description":""},{"name":"Powered Shot","required-level":"15","description":"Powerful ranged attack that explodes on impact, dealing 25% weapon damage as Arcane to targets within 6 yards and has a 50% chance to Stun targets for 2 seconds. ","cooldown":"20","cooldown-units":"seconds","cooldown-description":""},{"name":"Multishot","required-level":"15","description":"The Scoundrel's ranged attacks fire 3 bolts at a time. "},{"name":"Hysteria","required-level":"20","description":"Whenever you or the Scoundrel land a Critical Hit, you both will go into hysterics, increasing all damage done by 10% for 3 seconds. This effect cannot occur more than once every 5 seconds. "},{"name":"Anatomy","required-level":"20","description":"Increases Critical Hit Chance by 3% for you and the Scoundrel. "}]},{"name":"Enchantress","short-description":"Mistress of magic whose powerful illusions disable and confuse her foes.","features":[{"name":"Debilitating Magic","icon":"enchantress-feature-1","description":"Eirena's bewitching spells mean doom for your foes - she can force them into a dreamlike trance or turn them against one another, rendering them easier to kill."},{"name":"Arcane Blasts","icon":"enchantress-feature-3","description":"Eirena can conjure waves of arcane power to tear at enemies' bodies or send them flying away from the point of impact."},{"name":"Supportive Spells","icon":"enchantress-feature-2","description":"There's true utility in Eirena's magic, whether she's infusing your attacks with demon-slaying energy, or projecting force shields to protect you from danger."}],"description":"Eirena's mastery of enchantments and steely bravery in battle belie her youth - but the truth of her origins reconciles these qualities. Eirena hails from the distant era of the Mage Clan Wars, where she was part of a clandestine sisterhood of magic-users known as the Hand of the Prophet. When the leader of the sisterhood, the eponymous Prophet, foresaw a great disaster that would occur fifteen hundred years in the future, Eirena and her sisters pledged their lives to preventing the tragedy. The sisters' pledges were far from mere words, and the Prophet placed the entire sisterhood in a magical slumber to preserve them until the appointed time. Recently, Eirena awoke to find herself in a world of portents and turmoil, a land vastly changed from the one she remembers. Her sisters are dead, and the Prophet is nowhere to be found. Despite the shock of her situation, Eirena's purpose is clear: she has given herself over to a new age in the hopes that she will discover its salvation. Could her uncommon magic prove to be the key that will help you expel demonkind from Sanctuary? ","skills":[{"name":"Charm","required-level":"15","description":"Charms an enemy to fight for you for 4 seconds. ","cooldown":"25","cooldown-units":"seconds","cooldown-description":""},{"name":"Forceful Push","required-level":"15","description":"Summon an Arcane explosion 8 yards around an enemy, dealing 100% weapon damage as Arcane and knocking back all monsters caught within it. ","cooldown":"10","cooldown-units":"seconds","cooldown-description":""},{"name":"Missile Ward","required-level":"20","description":"Buffs you and the Enchantress, reducing damage from ranged attacks by 6%. "},{"name":"Powered Armor","required-level":"20","description":"Buffs you and the Enchantress, increasing Armor by 5% and slowing attackers by 30% for 3 seconds. "},{"name":"Disorient","required-level":"25","description":"Cast a flash of Confusion on a group of enemies in an area, causing them to stumble around disoriented for 2 seconds. ","cooldown":"25","cooldown-units":"seconds","cooldown-description":""},{"name":"Erosion","required-level":"25","description":"Conjures a pool of energy that deals 250% weapon damage as Arcane over 5 seconds. Affected enemies take an extra 15% damage from all attacks for 3 seconds. ","cooldown":"15","cooldown-units":"seconds","cooldown-description":""},{"name":"Focused Mind","required-level":"30","description":"A 40 yard aura that increases attack speed for you and the Enchantress by 3%. "},{"name":"Mass Control","required-level":"30","description":"Lob a bulb of magical energy that will hex a group of enemies into chickens for 5 seconds. Hexed enemies are unable to perform offensive actions. ","cooldown":"30","cooldown-units":"seconds","cooldown-description":""}]}],"skill-attributes":{"rune-separator":"!","passive-separator":"!","missing-value":".","follower-separator":"!","skill-mapping":["a","Z","b","Y","c","X","d","W","e","V","f","U","g","T","h","S","i","R","j","Q","k","P","l","O","m","N","n","M","o","L","p","K","q","J","r","I","s","H","t","G","u","F","v","E","w","D","x","C","y","B","z","A"],"skill-levels":[{"key":"Left Click","required-level":1},{"key":"Right Click","required-level":2},{"key":"1","required-level":4},{"key":"2","required-level":9},{"key":"3","required-level":14},{"key":"4","required-level":19},{"key":"","required-level":10},{"key":"","required-level":20},{"key":"","required-level":30}],"follower-levels":[{"required-level":5},{"required-level":10},{"required-level":15},{"required-level":20}]}}